{
    "jobs": [
        {
            "id": "E 930-053",
            "level": "Developmental",
            "location": "Tyson's",
            "qualifications": "Tysons, Monday - Friday, 8:30am-5:00pm: Service Desk; strong customer service, diverse IT background",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "id": "E 950-028",
            "level": "Full Performance",
            "location": "Reston",
            "qualifications": "Thurs-Mon (off Tuesday/Wednesday) 6:00 a.m. to 2:30 p.m. Prior experience in a service desk environment.  Active Directory experience.  Strong Customer Service Skills",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Help Desk/Support Specialist"
        },
        {
            "id": "E 800-061",
            "level": "Full Performance",
            "location": "Herndon",
            "qualifications": "Herndon; day shift; requires either a current DMA or a CMA willing to be trained as a DMA",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "id": "E 800-091",
            "level": "Senior",
            "location": "Other",
            "qualifications": "Service Desk - McLean or Warrenton - (M-F) 10:00am-6:30pm Candidate must possess excellent Customer Service skills (proactive, good communicator, responsive to customer needs). Demonstrated experience with Active Directory, Windows 7, Microsoft Outlook, and Microsoft Office Suite. Demonstrated hardware/application troubleshooting skills.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "This is a service desk position, not close support<br>Customer service experience in IT Service Desk environment <br>Knowledge/use of admin tools/admin console<br>Ability to remotely troubleshoot customer issues via phone/remote desktop support sessions<br>Knowledge of customer product base (software/hardware) helpful, but not required",
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "id": "E 800-130",
            "level": "Full Performance",
            "location": "Tyson's",
            "qualifications": "(Location:Tyson) Thorough understanding of Active Directory Services & Interfaces (ADS) Highly knowledgeable with applications that can access LDAP, NDS, and other directories ADSI interfaces. Highly knowledgeable with Windows 200x, Microsoft Exchange200x, Oracle10G & 11G. Knowledgeable in computer and network security concepts, techniques and systems. Knowledgeable in network components and interfaces. Knowledgeable of cloud operations. Ability to resolve and/or troubleshoot system problems while complying with Sponsors policies and procedures. Keep abreast of current development and trends in relative areas of technology. Produces professional documentations for standards, policies, and procedures. Ability to articulate complex technical architectures to a non technical audience. Be flexible in an environment that is consistently changing to meet the needs of the sponsor. Perform O&M services in COMSEC operational system to support ad-hoc customer requirements, duties include but not limited to maintenance and support for LMD/KP. Subsystems, Maintenance and support for the MGC and AKP, maintain connectivity to Central Facility, perform KP re-initialization, support re-certification, perform LMD/KPEKMS COMSEC account site initialization. Perform phase 5 platform conversion, update virus definitions, apply operating  systems patches as required and perform daily backups. Working knowledge with Unix/Linux operating systems.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Computer Engineer"
        },
        {
            "id": "E 800-173",
            "level": "Senior",
            "location": "Reston",
            "qualifications": "Candidate responsible for providing timely and dependable first tier, unclassified, desktop and access administration support customers. Candidate responsible for providing timely and dependable first tier, unclassified, desktop and access administration support customers<br>•\tMotivated IT professional supporting customers in person, via telephone or ESMT.<br>•\tAbility to receive, coordinate, analyze, track and resolve multiple customer requests. This includes hardware and software, diagnosing and resolving computer-related issues, coordinating customer requirements within the existing network team, assisting with the implementation of hardware/software upgrades and deliveries and reporting unresolved problems to appropriate technical personnel via ESMT.<br>•\tOvertime may be required to accomplish mission tasks.<br>•\tCandidate must remain flexible/adaptable to schedule, work location and workload variations as depicted by customer.<br>•\tCMA (Component Mission Administrator) access not required but beneficial to have.<br>•\tWorking knowledge of updating, patching and imaging workstations is required.<br>•\tExcellent customer service consulting and desktop diagnostic skills required.<br>Location: Reston, VA, potential need to support customers in McLean, VA on occasion. Hours are 8:00-4:30.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "•\tMotivated IT professional supporting customers in person, via telephone or ESMT.<br>•\tAbility to receive, coordinate, analyze, track and resolve multiple customer requests. This includes hardware and software, diagnosing and resolving computer-related issues, coordinating customer requirements within the existing network team, assisting with the implementation of hardware/software upgrades and deliveries and reporting unresolved problems to appropriate technical personnel via ESMT.<br>•\tOvertime may be required to accomplish mission tasks.<br>•\tCandidate must remain flexible/adaptable to schedule, work location and workload variations as depicted by customer.<br>•\tCMA (Component Mission Administrator) access not required but beneficial to have.<br>•\tWorking knowledge of updating, patching and imaging workstations is required.<br>•\tExcellent customer service consulting and desktop diagnostic skills required.",
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "id": "E 920-225",
            "level": "Senior",
            "location": "McLean",
            "qualifications": "CMA required; 6am-3:30pm",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "CMA Required; 6:30am-4pm",
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "id": "E 920-291",
            "level": "Full Performance",
            "location": "Herndon",
            "qualifications": "Required Skills: Hardware/Software testing, strong documentation skills, forensic experience<br>Desired Skills: Mobile OS, RF, Satellite, GSM, IPV6, Familiarity with any of the standard commercial forensic tools which may include Encase, FTK, ILOOK, Paraben, Helix",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Quality Assurance Specialist/Applications Tester"
        },
        {
            "id": "E 920-639",
            "level": "Full Performance",
            "location": "Herndon",
            "qualifications": "Location: Herndon.  Hours: TBD. Webmaster will support web content updates and website administration for training school websites.  Mandatory Skills:  Demonstrated on-the-job experience with web user interface; multimedia application integration into websites; designing and developing custom web sites and interactive applications. Key experience with JOOMLA, HTML, JavaScript, and CSS.  Desired Skills: Demonstrated on-the-job experience with Adobe Master Collection, AJAX, PHP, Ruby, XSLT, SQL Server or JSP.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Web Developer"
        },
        {
            "id": "E 900-092",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Microsoft SE.  WIN7, WIN8.0, WIN 8.1, Windows Server 2003, 2008 R2, 2012 R2, and Active Directory; VMware Workstation, Arcserve tape backup, HP  DL380 G7 servers and HP StorageWorks MSL6000 tape storage",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Required skills:<br>•\tExperience in supporting and managing Microsoft based systems.<br>•\tIn-depth knowledge of WIN7, WIN8.0, WIN 8.1, Windows Server 2003, 2008 R2, 2012 R2, and Active Directory.<br>•\tThorough knowledge of VMware Workstation, Arcserve tape backup, HP  DL380 G7 servers and HP StorageWorks MSL6000 tape storage. <br>•\tKnowledge of Amazon Web Services (AWS) a plus.<br>Duties include:<br>•\tBuilding, configuring and maintaining servers, server upgrades, data backup and restore, data transfer, scanning and patching servers and workstations, laptop support, vulnerability scanning using Nessus, and system accreditation using ICD 503.",
            "title": "Systems Operations Specialist"
        },
        {
            "id": "E 920-413",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "Operations Integration Engineer - Systems Engineer",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Systems Engineer - Operations Integration Level Expert <br>The primary responsibility of this position is to provide the Operations Support on the DevOps team within the Group.  They will support the integration of new systems, applications, and networks.  Performs all System Administration functions, as well as DevOps related duties and integration into the development cycle. <br>This role requires someone with proven experience with Cloud architecture, DevOps minded approach, and implementing solutions that support requirements of varying complexity. In addition, the candidate will be working alongside the development staff in planning and managing the coordinated effort of a team of stakeholders, information technology and related technical professionals.<br>This position is located in the Herndon/Chantilly corridor and is a night shift role - potential shifts are 4 / 10's starting at 12 noon or later. <br>Duties and Mandatory Skills: <br>•\tBachelors Degree in Computer Science, Engineering or a related technical discipline, or the equivalent combination of education, technical training, or work/military experience.<br>•\tUnderstanding of all phases of the software development lifecycle, the system engineering lifecycle, and the ability to comprehend end-user business needs and concerns while integrating the understanding with technical skills<br>•\tDemonstrated hands-on experience and knowledge of Linux platform (i.e. RHEL, CentOS) including administration, management, and troubleshooting<br>•\tHands on experience designing and writing scripts (I.e. powershell, bash, groovy) for the automation of installations, deployments, and configuration<br>•\tHigh-level knowledge of Cloud Computing, Cloud Foundry, Cloud Watch<br>•\tScripting experience with YAML, JSON (Ansible)<br>•\tAbility to work under pressure and time constraints<br>•\tDemonstrated ability to successfully multi-task simultaneous ongoing assignments and efforts<br>•\tDemonstrated experience performing the provisioning of development servers, networks, storage, use code versioning software, and performing software builds<br>•\tExecutes code deployment / migration and system configuration across multiple environment to Linux / Windows servers<br>•\tUses automated deployment tools, packaged RPM's, Maven, and Jenkins jobs<br>•\tProvides full integration support throughout the total system life cycle (including maintenance, administration, and management) across multiple systems/application/platforms, including a familiarity of relevant policies, standards, methods, and frameworks.<br>•\tTranslate business and technical requirements into test cases, test scenarios, and operations scripts and strong people skills for working with end-users<br>•\tAbility to plan and account for impacts of system development efforts across architectural system components, critical business processes, data, and applications<br>•\tExperience with automation / configuration management (Ansible, Puppet, Chef) and DevOps<br>•\tAbility and willingness to learn job related material and tasks<br>•\tDesired skills: <br>•\tExpert knowledge and experience with Linux/Unix<br>•\tStrong virtualization <br>•\tExperience with TCP/IP and general networking issues<br>•\tExperience providing superior customer service and support<br>•\tExperience with data mining tools (i.e., Splunk)<br>•\tExperience with monitoring tools (i.e., Nagios)",
            "title": "Systems Engineer"
        },
        {
            "id": "E 800-163",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "Documented UX experience designing visually pleasing and user friendly web interfaces..Full stack developer with documented experience developing web-based with JAVA, Spring and MySQL/Oracle. Experienced developing and consuming REST and SOAP web services. Experience with front end development, such as Angular, node.js, etc. Experience with Amazon C2S and cross-domain solutions. M-F",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Web Developer"
        },
        {
            "id": "E 800-165",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "(Architecture/Infrastructure Engineer, Significantly experienced with Linux server Administration and architecture in C2S.  Significant practical experience with  creating and implementing Amazon Cloud infrastructure.Ability and experience to document network architecture. Ability to appropriately size the Cloud infrastructure for performance and cost cost funding considerations. Server maintenance and patch application. M-F",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Systems Engineer - Infrastructure Engineer"
        },
        {
            "id": "E 900-085",
            "level": "Senior",
            "location": "Beltsville, MD",
            "qualifications": "Location:  Beltsville, MD; Senior Developer. Experience building and deploying solutions in ASP.NET, C#, Visual Studio, some Sharepoint",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Senior Developer<br>Required<br>Experience building and deploying solutions in ASP.NET, C#, Visual Studio and some SharePoint.",
            "title": "Web Developer"
        },
        {
            "id": "E 900-102",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "SharePoint, Visual Studio, .NET, Node.js, Web Dev, Angular. Experience on both MEAN and SharePoint platforms. This includes development of SharePoint out of the box and the development and O&M of the full MEAN stack which includes DBA functions for MongoDB, WebServer configuration for routing, authentication, authorization, IDAM, STS and SAL, Angular front-end design and Angular Library Component development.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Web Developer"
        },
        {
            "id": "E 920-520",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "Location: Herndon Hours: 8:00 a.m. - 4:30 p.m. SharePoint/Lotus Notes (Domino) experience. Experience/knowledge using SharePoint 2010 & 2013 Designer, Administration of SharePoint sites and site collection. Experience with SharePoint website redesigns. Experience/knowledge of Lotus Notes development and LotusScript. HTML, CSS, JQuery, JavaScript. Experience/knowledge with Adobe Suite (PhotoShop, Dreamweaver)",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Location: Herndon Hours: 8:00 a.m. - 4:30 p.m. SharePoint/Lotus Notes (Domino) experience. Experience/knowledge using SharePoint 2010 & 2013 Designer, Administration of SharePoint sites and site collection. Experience with SharePoint website redesigns. Experience/knowledge of Lotus Notes development and LotusScript. HTML, CSS, JQuery, JavaScript. Experience/knowledge with Adobe Suite (PhotoShop, Dreamweaver), Joomla",
            "title": "SharePoint Developer"
        },
        {
            "id": "E 920-633",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "Location: Herndon.  Secondary Scrub Required.  Candidate will be conducting vulnerability testing against operational platforms.  Candidate should have a degree or relevant work experience in areas of EE, Computer Science or Information System disciplines.  Candidate should have experience with computer forensics in mobile technologies and experience and comfort with Encase, FTK, XRY and other forensic products.  Typical skills highly desired: Conduct feasibility studies for operational deployment; Assess COTS products for operational technologies; Assess impact of environmental changes and technology evolution on operational systems; signature analysis and data steams; Forensic analysis data leakage; risk assessment throughout product development life cycles from conception to end of life (EOL); Product analysis reporting to include test plan creation, working drafts and participation in final report production; Assessing product vulnerabilities due to configuration and deployment criteria; Willingness to perform and participate in a collaborative, collective and peer review process environment. Core hours or as customer directs.  Local travel possible.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Quality Assurance Specialist/Applications Tester"
        },
        {
            "id": "E 800-167",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "Required Skills: Full stack developer with documented experience developing web-based applications with JAVA, Spring and MySQL. Experienced developing and consuming REST and SOAP web services. Desired Skills: Experience with common JavaScript frameworks, Amazon C2S and cross-domain solutions.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Web Developer"
        },
        {
            "id": "E 920-304",
            "level": "Senior",
            "location": "McLean",
            "qualifications": "Additional Security Scrub Required - Commercial forensic tools experience required (FTK, Paraben, Helix, Ilook, Xways, WireShark, FireEye); Experience w the Mac Operating system; Programming experience with Java, C, C++, Perl, Python, Enscripts. Demonstrated experience with Linux/Unix, Mobile OS, Android",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Commercial forensic tools experience required (FTK, Paraben, Helix, Ilook, Xways, WireShark, FireEye); Experience w the Mac Operating system; Certified Pen tester, programming experience with Java, C, C++, Perl, Python, Enscripts, Linux/Unix, Mobile OS, Android; Encase experience required; Encase certification strongly desired, but not required",
            "title": "Cyber Security Forensic Specialist"
        },
        {
            "id": "E 920-496",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Build Engineer",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Systems Engineer/Systems Integrator - BUILD Engineer<br>Senior Systems Integration Engineer. The primary responsibility for this position is working with management team and engineering and operational resources.<br>Working under minimal supervision the selected candidate will work with a technical group on projects from reviewing requirements to ensure system compatibility for optimal system performance; collaborate with business users to discuss requirements; perform current state system analysis; write functional and technical specifications of current state systems, provide weekly status reports regarding system engineering and integration initiatives. The successful candidate will have proven experience with establishing integrated project team structure and assignments and experience leading, directing and managing enterprise IT system development/engineering efforts, tasking, and schedules through work breakdown structure and program planning.<br>This role requires someone with proven experience implementing cross domain solutions that support requirements of varying complexity in addition to planning and managing the coordinated effort of a team of different stakeholders, information technology, and related technical professionals, to include personnel with different organizations with competing interest (e.g., customer, cross domain governing bodies, hosting facility, and technology provider).<br>• Bachelor's degree in Computer Science, System Engineering or related field and 13 years of professional experience which should include either management consulting experience or relevant industry knowledge<br>• Understanding of all phases of the software development lifecycle, the System Engineering Life Cycle, and the ability to comprehend user business needs and concerns and integrate that understanding with technical skills<br>*Translate business and technical requirements into test cases, test scenarios, and operational scripts<br>*Ability to plan and account for impacts of system development efforts across architectural system components, critical business processes, data, and application<br>*Strong background in Linux/Unix Administration<br>*Experience with automation / CM (Ansible, Puppet, Chef) and working knowledge of code and scripting (python, perl, ruby, etc<br>• Hands-on experience designing and writing scripts (i.e. power shell, bash, groovy) for the automation of installations, deployments and configuration<br>• Ability to Work under pressure and time constraints<br>• Demonstrated ability to successfully multi-task simultaneous ongoing assignments and efforts<br>• Demonstrated experience performing the setup and configuration of IDE and development servers, use code versioning software, and performing software builds<br>• Execute code deployment/migration and system configuration across multiple environments to Linux and Windows servers<br>• Use automated deployment tools, packaged RPMs, Maven and Jenkins Jobs<br>• Provide full integration support throughout the total system life cycle (including maintenance, administration, and management) across multiple systems/applications/platforms, including a familiarity of relevant policies, standards, methodologies and frameworks<br>• Ability and willingness to learn job related material and tasks<br>Desired Skills: <br>*Expert knowledge and experience with Linux/Unix<br>*Strong Virtualization skills (vmware, openstack, hyper v)<br>*Proven track record of building and deploying an automation framework from scratch using Ansible<br>• Knowledge of Big Data tools including Hadoop ecosystem, blur, etc.<br>• Experience with Enterprise monitoring tools (i.e Splunk and Nagios)<br>• Knowledge of enterprise monitoring and logging solutions<br>• Ability to identify gaps in system designs as it relates to enterprise monitoring and logging standards",
            "title": "Systems Engineer"
        },
        {
            "id": "E 920-624",
            "level": "Senior",
            "location": "McLean",
            "qualifications": "POSITION GOING ON HOLD. Location: McLean<br>Hours: TBD.<br>This position requires an extra scrub.<br>Mandatory skills: Demonstrated experience in information systems development, focused on bridging engineering, technology, and end user requirements with data owner, legal and policy requirements of data feeds. Extensive Extract, Transform and Load (ETL) experience to include data model analysis, mapping various types of data, implementing mappings as ETL routines and debugging existing ETL routines. Researches, designs, develops and tests operating systems level software, compilers and network distribution software for industrial, military, communications, aerospace, business, scientific, and general computing applications and dataflows. Analyzes user interfaces and dataflows, maintain hardware and software performance tuning, analyze workload and computer usage, maintain interfaces with outside systems, analyze downtimes, analyze proposed system modifications, upgrades and new COTS. Coordinates closely with programmers to ensure proper implementation of program and system specifications. Review existing programs and assist in making refinements, reducing operating time and improve its performance. Confer with system analysts, engineers, programmers and others to design system and to obtain information on project limitations and capabilities, performance requirements and interfaces. Obtain and evaluate information on factors such as reporting formats required, costs, and security needs to determine hardware configuration. Consult with engineering staff to evaluate interface between hardware and software, develop specifications and performance requirements and resolve customer problems. Monitor functioning of equipment to ensure system operates in conformance with specifications. Store, retrieve, and manipulate data for analysis of system capabilities and requirements. Designs, develops and maintains applications within the cloud environment for new or legacy applications. Multiple years working with Pentaho, Streamsets, NiFi, Airflow or similar application for platform deployment, patch deployment and plugin creation. Proven development abilities in multiple object-oriented languages such as Java, C++, Visual Basic and scripting languages such as Perl, BASH, Python. Database design and programming on multiple platforms including Oracle and MySQL. Demonstrated experience writing complex SQL queries, writing data, table and index management statements and understanding database structures, indices, normal forms to improve performance. Experience with ElasticSearch, Cassandra, MongoDB. Big data platform development and administration including against Hadoop and/or Spark. Demonstrated hands-on experience working with COTS, GOTS and Open Source capabilities for processing data to meet analytical requirements.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Engineer"
        },
        {
            "id": "E 930-121",
            "level": "Senior",
            "location": "Tyson's",
            "qualifications": "Mandatory skills: Domino experience (to handle O&M tasking), Web development experience and a willingness to learn Service Now development. Experience with HTML and browser compatibility baselines, section 508 accessibility, DB design, tuning and DB driven web development, and developing test plans.<br>Desired skills: WordPress/TalkAbout, Java, JavaScript",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Developer (Systems Software)"
        },
        {
            "id": "E 930-122",
            "level": "Senior",
            "location": "Tyson's",
            "qualifications": "Mandatory skills: Service Now development or willingness to learn. Experience with either WordPress/TalkAbout or Java with some of the following (JavaScript, ElasticSearch, AWS Cloud, Jira, GitHub, Git, Maven, Nexus, Tomcat, MySQL) Experience with HTML and browser compatibility baselines, section 508 accessibility, DB design, tuning and DB driven web development, and developing test plans.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Developer (Systems Software)"
        },
        {
            "id": "E 800-161",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Required Skills:  Full stack developer with documented experience developing web-based applications with JAVA, Spring and MySQL. Experienced developing and consuming REST and SOAP web services. Desired Skills:  Experience with common JavaScript frameworks, Amazon C2S and cross-domain solutions.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Web Developer"
        },
        {
            "id": "E 920-056",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Location: Herndon.  Looking for an Expert Domino developer with experience in Java, JavaScript, LotusScript, JQuery, CSS, HTML, with special emphasis on XPages.  Additionally, knowledge of AWS/Cloud administration, Lotus Domino Administration, and SharePoint development is desired, but not required.  Will work on a small team of developers fulfilling organizational specific tasks.  Core Hours: 9 a.m. to 3: p.m.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Developer (Systems Software)"
        },
        {
            "id": "E 920-626",
            "level": "Expert",
            "location": "McLean",
            "qualifications": "Location: McLean. Hours: TBD.  This position requires an extra scrub. Mandatory Skills: Data Architect is responsible for acquiring, processing, and refining large or complex data sets from various sources utilizing computer programming where necessary. Analyze, evaluate, and assess quantitative data using statistical software (computer models, geospatial models, software languages, mathematical models) to contribute to or develop software tools, analytic models, or report. Anticipate and project a wide range of possible outcomes using scenario/alternative analyses, machine learning or other advanced analytic techniques. Demonstrated experience developing new data workflow and approaches using Pentaho and custom scripting to handle high volume, heterogeneous data used to identify patterns, correlations, trends, and relationships. Experience in data science methodology to integrate systems engineering and data science techniques. Demonstrated experience with data architecture, data modeling, database design, and data systems implementation especially with Oracle-based technologies such as MySQL, NoSQL technologies like ElasticSearch, and distributed systems like Hadoop, or HPCC. Demonstrated experience in data analysis of structured and unstructured data, including financial, web, event and travel data. Demonstrated experience with two or more: XML, JSON, SQlLte databases, PCAP. Demonstrated experience in developing customer data visualizations using COTS products like Tableau or Kiabana. Desired Skills: Demonstrated experience working independently to formulate and execute project plans, leading teams of data engineer and analysts, providing training on the use of new tools, technologies and data sets. Demonstrated experience manipulating and deriving actionable information from large data sets. Demonstrated experience with development in a Unix/Linux environment, bash scripting, deploying code, using servers and virtual machines. Demonstrated experience in coding languages like Python, Java, ECL, SQL, Javascript or C.  Demonstrated experience in bulk analysis of systems log data, COTS and custom-developed Natural Language Processing (NLP) and text analytics, content analysis tools, algorithms as well as developing or implementing machine learning, statistical analysis, and NLP techniques on bulk data.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Data Architect"
        },
        {
            "id": "E 920-620",
            "level": "Subject Matter Expert",
            "location": "McLean",
            "qualifications": "This position is for a Data Scientist.<br>Location: McLean<br>Hours: TBD.<br>This position requires an extra scrub.<br>Mandatory Skills and Knowledge: Demonstrated on the job experience manipulating data for analysis. Demonstrated on the job experience constructing complex queries to analyze results using databases or data processing development environments. Demonstrated on the job experience aggregating results and/or compiling information for reporting. Demonstrated on the job experience as an all source analyst. Demonstrated on the job experience reviewing highly technical data from various sources. Working knowledge of appropriate analytic methods and methodological tools in one or more of the following areas: Applied mathematics (probability and statistics, formal modeling, computational social sciences), Computer programming (programming languages, math/statistic packages, computer science, machine learning, scientific computing), Visualization (GIS/geosptial analysis). Ability to leverage multiple data management tools to organize relevant information and make decisions. Ability to develop comprehensive software applications, as needed. Ability to translate complex, technical findings into an easily understood narrative in graphical, verbal or written form. Ability to identify gaps and offer technical solutions based on both technical and non-technical descriptions of customer workflows and requirements.<br>Tasks and Responsibilities: Determine and employ the most appropriate research design for data collection and analysis. Acquire, process, and refine large and complex data sets from various sources; utilizing computer programming where necessary. Analyze, evaluate, and assess quantitative data to contribute to or develop software tools, analytic models or reports. Conduct statistical, mathematical, geospatial modeling or data-mining analysis in partnership with other Data Scientists or Analysts. Anticipate or project possible outcomes using scenario/alternative analysis, machine learning, and other advanced analytic techniques. Identify, use and/or develop a wide range of methodologies and analytic tools to address existing or potential problems and strategies.<br>Desired Skills: Demonstrated on the job experience with software development. Demonstrated on the job experience developing and documenting custom algorithms in response to customer requirements. Demonstrated on the job experience with SQL, R, Python.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Data Architect"
        },
        {
            "id": "E 920-630",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "Software Developer:<br>* Provides development engineering and programming support to mission-supporting applications. <br>* Designs and develops mission applications in a web environment. <br>* Develops, creates and modifies general computer applications software or specialized utility programs.<br>* Analyzes user needs and develops software solutions.<br>* Designs software or customizes software for client use with the aim of optimizing operational efficiency.<br>* May analyze and design databases within an application area, working individually or coordinating database development as part of a team.<br>* May manage websites including design, development, deployment and maintenance activities, as well as performing testing and quality assurance of websites and web applications.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Software Developer in AWS",
            "title": "Software Developer (Systems Software)"
        },
        {
            "id": "E 920-631",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "Software Developer:<br>* Provides development engineering and programming support to mission-supporting applications. <br>* Designs and develops mission applications in a web environment. <br>* Develops, creates and modifies general computer applications software or specialized utility programs.<br>* Analyzes user needs and develops software solutions.<br>* Designs software or customizes software for client use with the aim of optimizing operational efficiency.<br>* May analyze and design databases within an application area, working individually or coordinating database development as part of a team.<br>* May manage websites including design, development, deployment and maintenance activities, as well as performing testing and quality assurance of websites and web applications.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Developer (Systems Software)"
        },
        {
            "id": "E 920-404",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Primary responsibility for this SME level ISSE is to work alongside Customer Management teams, engineering branch and operational resources to provide overarching security support for the entire group.  Work within the infrastructure division but oversee all security responsibilities over the application group and systems teams. Group level of 400+ and over 6 mission critical networks (private) and 25 applications. Complete A&A scans, provide guidance on mitigations, submit Accreditation requests, ATO packages, and provide overarching security guidance for systems. Provide engineering solutions, system designs, product/protoyping, and IT strategy for the future system movement of current infrastructure into a cloud based environment. <br>This successful candidate must be able to communicate well across divisions, provide accurate and concise security guidance, think through creative solutions with the ISSM's, and ensure our systems remain in good security standing. <br>Mandatory Skills Needed: <br>• Minimum of SME level years (16 years or 13 years with a degree) of progressively responsible experience in Cyber Security, InfoSec, Security Engineering, Network Engineering with emphasis in cyber security issues and operations, computer incident response, systems architecture, data management. This includes malicious code detection, intrusion detection, and cyber security tool development and integration<br>• Review security plans and assist in developing security measures to safeguard information<br>• Provide guidance in the formulation of INFOSEC policies<br>• Provide INFOSEC guidance and direction at project inception and continuing through the lifecycle<br>• Assist in evaluating and ensuring the compliance of customers IT systems, applications, and infrastructure, assessing vulnerabilities and providing appropriate security countermeasures<br>• Communicate security exposure, INFOSEC incidents, or noncompliance situations<br>• Represent customer interests at technical exchange meetings and across the organization<br>• Create artifacts and perform activities as necessary to implement IC and Agency security processes for product approval, system accreditation, procurement, or modification<br>• Leverage commercial products to support the security our infrastructure, systems, and applications<br>• Review technical documentation to determine compliance with IC, Agency, and security directives<br>• Conduct, participate, brief, and facilitate security information activities highlighting schedule, risk assessments, evaluations, analysis<br>• Develop, document, and maintain security plans<br>• Create and document security requirements for systems and interfaces on numerous networks and platforms<br>• Analyze systems, including forensically, for malware, misuse, and/or unauthorized activity. Track, on a daily basis, intelligence (both open and classified sources) concerning malicious code threats<br>• Hands on experience with network security applications, protocols and associated hardware<br>• Good interpersonal, organizational, writing, communications and briefing skills<br>• Strong analytical and problem solving skills<br>• Hands on experience with Nessus, App Detective, Web Inspect, SuperScan<br>• Hands on experience Microsoft Office<br>• Hands on experience Information Assurance assessment tools<br>• Experience with Encryption technologies<br>• Experience with Identity and authentication technologies<br>Certifications: Certified Information Systems Security Professional (CISSP)",
            "title": "Cyber Security InfoSec Engineer"
        },
        {
            "id": "E 920-524",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "Location: Herndon Hours: TBD [Network Engineer] Primary focus of position is designing and implementing an enterprise level network that supports the customer's vision for the current and new hosting environments.  The engineering design must be flexible and scalable to support the bare-metal and especially cloud hosting infrastructure.  Secondary focus is designing and implementing an enterprise level security to protect the network layer. Candidate expected to conduct research and analysis to provide a recommendation for the suitable security technology to protect the hosting network.  Demonstrated experience working in Network Telecommunication field, routing, switching, load balancer, and firewalls.  LAN, WAN, troubleshooting Routing Protocols (i.e. OSPF, EIGRP, and BGP), Gateway Redundancy Protocols (i.e. HSRP, VRRP, GLRP).  VoIP, Multicast, STP, Virtual LANs, Network Controlled Interfaces/Security: Firewalls, ACL, IPSec Tunnels.  Experience CISCO Routers, Network Management, Network Monitoring, and Citrix NetScaler technology.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Must have AWS/C2S Cloud network experience.",
            "title": "Network Engineer"
        },
        {
            "id": "E 900-021",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "This position is for a Java developer. The application itself has a Java front end and Oracle back end. The system is a complex one and we need someone who is a self-starter and quick learner. They will start out fixing current bugs in the system to acclimate themselves and will also have access to the code of which they will need to dive into and examine, understand, etc. as they work more complex problems. Familiarity with JSF, Spring/hibernate stack, Ajax, Oracle 11g and hibernate, GIT, Mochito, Jenkins, Maximo, jquery a plus.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "This position is for a Java developer. The application itself has a Java front end and Oracle back end. The system is a complex one and we need someone who is a self-starter and quick learner. They will start out fixing current bugs in the system to acclimate themselves and will also have access to the code of which they will need to dive into and examine, understand, etc. as they work more complex problems. Familiarity with JSF, Spring/hibernate stack, Ajax, Oracle 11g and hibernate, GIT, Mochito, Jenkins, Maximo, jquery a plus.",
            "title": "Software Developer (Systems Software) - Mission Software Developer"
        },
        {
            "id": "E 900-155",
            "level": "Subject Matter Expert",
            "qualifications": "Seeking a highly and experienced System Architect/Engineer with hands-on expertise in the design, implementation adoption and adherence to enterprise architecture strategies and information systems security standards. This specific role requires expertise in a broad range of physical infrastructure and cloud technologies in the areas of infrastructure as a Service (laaS), Platform as a Service, and Software as a Service (Saas). Strong experience designing and implementing systems/enclaves, storage solutions and virtual environments. The candidate must have the ability to work with senior leadership to design and establish an environment/system based off of validated requirements that lead to the fulfillment of sponsor objectives.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Job Requirements:<br>Demonstrated domain leadership in C2S technologies, hybrid-cloud technologies and physical infrastructure.<br>Demonstrated experience designing and implementing infrastructure environments.<br>Demonstrated ability to lead infrastructure Evaluation assessments and align them with sponsor objectives.<br>Demonstrated application of end-to-end architecture strategies, standards, processes, and tools.<br>Expertise in architecting and leading the deployment of large scale Big Data Systems.<br>Experience leading/supporting the design and development of hybrid-cloud solutions.<br>Experience with performing technical due diligence to select/software/vendors.<br>Lead/Advise senior leadership on organization/project technical strategies.<br>Experience implementing automation capabilities in C2S and physical infrastructure environments.<br>Ensure appropriate level of documentation I prepared and baselined.<br>Strong understanding of the breadth of C2S solutions and ability to implement them in a security compliant way.<br>Demonstrated experience in documentation, working directly with non-technical customers and translating their requirements based on those prototypes.<br>Demonstrated expertise and success leading and implementing large-scale systems through sponsor system security process.<br>Demonstrated experience with designing, building and operating systems using enterprise services across the sponsor domain.<br>Demonstrated experience working with partners.<br>Demonstrated experience with Platform as a Service (Paas) technology.<br>Demonstrated experience evaluating and prototyping new technologies.<br>Application Design, Development, and Testing-Software Life Cycle Management techniques and sponsor tools for managing requirements.<br>Strong, working verbal and written business and technical communication skills.<br>Solid understanding of storage architectures.<br>Ability to institute organizational change around sponsor objectives.",
            "title": "Systems Architect"
        },
        {
            "id": "E 920-617",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "Software Development - Herndon<br>Supporting a software development effort using AWS environment and helping to connect end users to their data.<br>This is a big data effort, where the developer will use CLIME data analysis software and Elasticsearch.  The developer will also interact one-on-one work with the customer/end user to elicit requirements and functionality.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Software Development - Herndon<br>Supporting a software development effort using AWS environment and helping to connect end users to their data. <br>This is a big data effort, where the developer will use CLIME data analysis software and Elasticsearch.  The developer will also interact one-on-one work with the customer/end user to elicit requirements and functionality.",
            "title": "Software Engineer"
        },
        {
            "id": "E 920-529",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "Location: Dulles area Hours: Core hours 08:30am-5:00pm Cloud Storage Engineer (AWS/C2S/S3/Glacier) Primary focus is designing and implementing an enterprise level storage and backup solution that supports the customer's current and new hosting environments.  Secondary focus is designing and implementing an enterprise level security to protect the storage layer.  Demonstrated experience with engineering and implementing SAN and NAS technology, experience creating LUN and WWN, experience with Fiber Channel switch and enterprise storage array configuration and management, experience with storage management, monitoring, and SRM tool sets.  Experience with virtualization in developing and implementing complex virtualization systems and the automatic provisioning of different components (VMware, Hyper-V, Xen).  Demonstrated experience with engineering, operating and maintaining the enterprise backup and recovery solutions.  Demonstrated excellent Tier 1-3 storage and backup troubleshooting skills.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Systems Engineer - Infrastructure Engineer"
        },
        {
            "id": "E 920-528",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "Cloud Engineer-SECURITY SCRUB REQUIRED - The primary focus of this position is engineering, Cloud Engineering, and Data and Application Security. The secondary focus of this position is platform engineering, including 30% Windows and Citrix O&M. The Cloud Engineer is responsible for developing and maintaining high visibility cloud-based IT systems. The successful candidate provides support for development in and/or transition  to the cloud, implementation, troubleshooting and maintenance of IT systems. Manages system infrastructure and any processes related to these systems. Provides support to IT systems including : day-to-day operations, monitoring and problem resolution for all of the client problems. This position will serve as the Engineering SME and will be responsible for the development and delivery of the modular enterprise architecture,  engineering design, and implementation plan of the identity management to support the mission and vision. The modular enterprise engineering design must be flexible to support the infrastructure hosting workloads for Amazon Web Services (AWS). The position will be responsible for the development and delivery of Sponsor's cloud adoption and migration. This position will serve as the Platform Engineering SME to provide the technical guidance and direction to design the modular operating system baselines to support the modular data and application Tier hosting strategy. This position will serve as the Data and Application Security SME to provide technical guidance and direction to engineering a modular security design to protect the workloads hosting services for Amazon Web Services (AWS). This position will introduce and champion the SysOps and DevOps concepts for the Sponsor. The successful candidate will need to demonstrate outstanding hands-on experience and thorough understanding hands-on experience and thorough Platform engineering, Data and Application Security engineering and Cloud services. The candidate must demonstrate on-the-job competences and in-depth Linux experience working and integrating  Open Source frameworks/products, experience deploying various open source packages and/or application stacks into sponsor's production landscape, multi-core, multi-threaded and distributed system. The selected candidate will be expected to know how to both craft and drive good requirements and specifications documentation. The selected candidate will be expected to quickly self-learn new technologies and be passionate when it comes to making technical breakthroughs and solving complex problems. The selected candidate will need to have a diverse IT background, strong hands-on technical experience, organizational and interpersonal skills working as part of a team and at times in a highly autonomous manner, mentoring others as needed. Additional mandatory skills: 1) Demonstrated competencies with enterprise solutions architecture, technical  leadership and strategy, enterprise data and analytic engineering, enterprise software development and SysOps/DevOps. 2) Demonstrated engineering experience and outstanding in-depth knowledge with Cyber security, Cloud Computing, Data and Application Security technologies. 3) Demonstrated engineering experience and knowledge with Linus (RHEL, VentOS, Scientific Linux) and Microsoft Windows Server (2008 r2, 2012 R2) environments and be able to build, configure and maintain via Command Line Interface (CLI). 4) Demonstrated engineering experience and outstanding in-depth knowledge with the underlying storage for Linux (LVM), storage network technologies (e.g. SAN, NAS) and protocols (e.g. NFS, CIFS), database (e.g. Oracle, MySQL, SQK+L, Server, Postgres, Kafka, etc.) and/or clustered/pooled virtualizations concepts from leading platforms (e.g. XenServer, Hyperv, VMware, etc.) creating and configuring virtual and private clouds (VPCs). 5) demonstrated engineering experiences and outstanding in-depth knowledge of information security practices (cryptography, privilege separation, RBAC, Auditing, Patching, Security Benchmark compliance, OS hardening, etc.) 6) Demonstrated experience using Amazon Web Service technologies AWS Command Line, Amazon Machine Images, Creating elastic Compute Cloud (EC2) instances, Simple Storage Service (S3), Elastic Block Storage (EBS), Virtual Private Cloud or Cloud Watch. 7) Demonstrated Tier -3 SME troubleshooting, investigating, and performing root cause analysis on production incidents. Evaluating systems and making recommendations to increase availability and efficiency. 8) Demonstrated engineering experience and outstanding in-depth knowledge with server hardware from major vendors such as IBM or HP. 9) Demonstrated in-depth understanding of proactive monitoring concepts, including experience configuring and deploying Network and system's monitoring, SNMP, Relational Databases (e.g. Ganglia, Nagios, Splunk, Solarwinds, NosQL and caching layers such as Memcache). 10) Demonstrated in-depth troubleshooting and outstanding understanding of Internet/Web related protocols and technologies (e.g. Apache, Tomcat., Web Services, DNS, registrars, SSL, web hosting providers).",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Systems Engineer - Cloud Engineer"
        },
        {
            "desired": "1. Demonstrated experience creating and maintaining requirements traceability matrices.<br>2. Demonstrated experience defining and implementing requirements management processes.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29126",
            "location": "Chantilly",
            "mandatory": "1. Demonstrated experience independently gathering, documenting and managing high level and detailed requirements (Systems, Functional, and User) for enterprise applications.<br>2. Demonstrated experience gathering, documenting and managing high level and detailed requirements (Systems, Functional, and User) for Projects/programs utilizing an Agile development methodology.<br>3. Demonstrated experience as a Business Process Analyst working with customers to define/record 'as is' business processes, as well as helping to discover 'to be' business processes to streamline business efforts and increase productivity.<br>4. Demonstrated experience as a Sharepoint Administrator managing a repository of requirements documentation.<br>5. Demonstrated experience as a requirements lead or in a position with significant requirements responsibilities aimed at gathering and documenting customer requirements in a fast-paced, high-visibility environment.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Requirements Specialist will work directly with Senior Leadership, Subject Matter Experts and stakeholders across the Sponsor to define existing processes, develop future state business processes and functional work streams to be used in the development of a large scale software solution for security task management. This individual will define and document business and functional requirements. This individual will collaborate with Project Managers, Systems Architects and Software Engineers who will translate these requirements into end-to-end process architecture for use in future state system functionality.<br>The Requirements Specialist will support the sponsor through all aspects of the requirements process to include; stakeholder interviews and review sessions, documentation of requirements and action items and ensuring follow through. This individual will validate findings from user groups and develop presentational materials to document current and future state understanding. In addition, this individual will present findings to senior leadership and incorporate feedback which will be used by the technical team to prepare requirements for systems implementation.",
            "sourceDate": "01/15/2019",
            "title": "Requirements Specialist"
        },
        {
            "desired": "1. Demonstrated experience with Java Enterprise Edition (JEE) design and development.<br>2. Demonstrated experience with Java open source frameworks, including Spring.<br>3. Demonstrated experience with Java unit testing frameworks.<br>4. Demonstrated experience with the agile software development model.<br>5. Demonstrated experience requesting and installing PKI certificates in the Sponsor's environment.<br>6. Demonstrated experience authoring SQL statements using Oracle.<br>7. Demonstrated experience with provisioning systems, attributes, roles and ETL rules.<br>8. Demonstrated experience and in-depth knowledge of with Secure Socket Layer (SSL) and the various error conditions related to SSL-handshake failures.<br>9. Demonstrated experience interfacing with the various programs in the Sponsor’s access services group.<br>10. Demonstrated experience with the PingFederate product from PingIdentity or commitment to obtain training within 3 months.",
            "dueDate": "02/07/2019",
            "id": "I 2019-29423",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience installing and interfacing with LDAP directories.<br>2. Demonstrated experience installing and configuring DevOps tools, specifically Jenkins, Artifactory, Nexus, and Rundeck.<br>3. Demonstrated experience authoring custom Puppet modules and Rundeck jobs.<br>4. Demonstrated experience supporting virtual LDAP directories, ETL processes, and notification-driven update processes.<br>5. Demonstrated experience working with Amazon Web Services, including authoring CloudFormation templates.<br>6. Demonstrated experience working in a Linux environment, including monitoring system resources and authoring bash scripts.<br>7. Demonstrated experience with the Git version control system.<br>8. Demonstrated experience supporting customers in a production environment.<br>9. Demonstrated experience with software architecture and system design for critical, enterprise-grade systems and interfaces.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Customer is looking for an energetic, creative resource with excellent skills and a proven track record of successful technical project implementation. The Candidate will work closely with customer’s staff lead for Authentication and Attribute Services program activities within the Sponsor's office. The individual will serve as a member of an agile team. They will develop, maintain and enhance the components and perform installation, maintenance, and deployment of the COTS product, making configuration changes as needed. In addition, as a part of the team they will be responsible for fiscal year planning activities, user story prioritization for agile sprint cycles, architectural design decisions, and triaging customer problems as needed.<br>Prior knowledge of cloud technologies is mandatory. The Systems Engineer will interface with the development teams during deployments or troubleshooting. The successful candidate will work with new and existing customers to ensure authentication, identity propagation and attribute service requirements are satisfied. The individual will provide ad hoc support to project-related activities as needed and tasked by management, and will work with project management to prioritize multiple customer stories and tasking when conflicts arise. This work requires significant interaction across many customers and groups and other Service Providers to understand requirements, assess enterprise capabilities that fulfill these needs, and ensure services are compliant with customer's governance.",
            "sourceDate": "01/25/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Demonstrated on-the-job experience with mobile and web usability research skills.<br>2. Demonstrated on-the-job experience with accessibility skills for assistive technologies.<br>3. Demonstrated on-the-job experience working in an agile development methodology.<br>4. Demonstrated on-the-job experience with verbal and written communication skills.<br>5. Demonstrated on-the-job experience with collaboration and organizational skills. <br>6. Certification in user experience, such as Human Centered Design.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29466",
            "location": "Reston",
            "mandatory": "1. Demonstrated on-the-job experience in designing and developing intuitive, easy to use front end user interfaces using Javascript, Node.JS, and Angular.<br>2. Demonstrated on-the-job experience analyzing user needs and designing user interface prototypes for user elicitation and front end development, using graphics software prototyping tools such as PowerPoint, Publisher, or Adobe Create Suite.<br>3. Demonstrated on-the-job experience translating the user stories and user interface prototypes in to detail design/front end solutions.<br>4. Demonstrated on-the-job experience working in tandem with the development team in turning detail design into software solutions/APIs.<br>5. Demonstrated on-the-job experience incorporating technical considerations into application design plans, such as performance requirements, accessibility, access restrictions, and maintainability.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The requested candidate will be responsible for conducting User Experience research, assisting in summarizing and presenting findings to teammates, business partners, and other stakeholders. The right candidate will work across different types of quantitative and qualitative user research, including interviewing and observation, usability and iterative testing. The candidate will design, prototype user interfaces, and demo prototypes for user elicitation purposes, balancing working on various projects on both the online and mobile client experience. A strong candidate is expected to be knowledgeable about best practices in design, usability, and accessibility will work with online and mobile usability research as well as usability testing tools, techniques and methodologies.",
            "sourceDate": "01/15/2019",
            "title": "Web Developer"
        },
        {
            "desired": "1. Demonstrated experience ensuring the operability of applications upon deployment and sustained O&M.<br>2. Demonstrated experience developing and deploying applications using DevOps tools and processes.<br>3. Demonstrated experience supporting and troubleshooting network services using protocols such as TCP/IP, DNS, LDAP, SSH, SSL, TLS, HTTP, HTTPS, SMTP.<br>4. Demonstrated experience ensuring all production environments are in compliance with Security requirements accreditation.<br>5. Demonstrated experience troubleshooting and problem solving (i.e., analyzing information and evaluate results to choose the best solution and solve problems) skills.<br>6. Demonstrated experience creating, maintaining and sharing scripts to automate builds for a standard apps configuration such as Tomcat.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29516",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience administrating web applications within the last 2 years.<br>2. Demonstrated training and/or experience in deploying, automating and using Amazon Web Services (AWS) technologies, including AWS Command Line Interface (AWSCLI),<br>3. Demonstrated experience with installing, configuring and troubleshooting web and application servers such as Apache HTTPD, and Apache Tomcat.<br>4. Demonstrated experience patching Linux (e.g. CentOS 6. x) variants.<br>5. Demonstrated experience learning new commercial off the shelf (COTS) and customer developed software applications.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The System Administrator delivers technical and operational support to key applications in the Sponsor's enterprise environment. Specifically, the System Administrator supports the operation and migration of existing business systems/services while continuously evaluating new technologies [i.e. Infrastructure-as-code, PaaS, SaaS], to increase efficiency delivering customer-value.<br>Ideally, we are looking for someone that can support multiple projects. In addition, identifying and clearly articulating the requirements is key.",
            "sourceDate": "01/15/2019",
            "title": "Systems Administrator"
        },
        {
            "desired": "1. Demonstrated experience with Java Enterprise Edition (JEE) design and development.<br>2. Demonstrated experience with Java open source frameworks, including Spring.<br>3. Demonstrated experience with Java unit testing frameworks.<br>4. Demonstrated experience with the agile software development model.<br>5. Demonstrated experience requesting and installing PKI certificates in the Sponsor's environment.<br>6. Demonstrated experience authoring SQL statements using Oracle.<br>7. Demonstrated experience with provisioning systems, attributes, roles and ETL rules.<br>8. Demonstrated experience and in-depth knowledge of with Secure Socket Layer (SSL) and the various error conditions related to SSL-handshake failures.<br>9. Demonstrated experience interfacing with the various programs in the Sponsor’s access services group.",
            "dueDate": "02/06/2019",
            "id": "I 2019-29616",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience installing and interfacing with LDAP directories.<br>2. Demonstrated experience installing and configuring DevOps tools, specifically at least 3 of the following: Jenkins, Artifactory, Nexus, Rundeck.<br>3. Demonstrated experience authoring custom Puppet modules and Rundeck jobs.<br>4. Demonstrated experience supporting virtual LDAP directories, ETL processes, and notification-driven update processes.<br>5. Demonstrated experience working with Amazon Web Services, including authoring CloudFormation templates.<br>6. Demonstrated experience working in a Linux environment, including monitoring system resources and authoring bash scripts.<br>7. Demonstrated experience with the Git version control system.<br>8. Demonstrated experience supporting customers in a production environment.<br>9. Demonstrated experience with software architecture and system design for critical, enterprise-grade systems and interfaces.<br>10. Demonstrated experience as the technical lead and architect of a critical enterprise system.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Customer is looking for an energetic, creative resource with excellent skills and a proven track record of successful technical project implementation. The Candidate will work closely with customer’s staff lead for Authentication program activities within the Sponsor's office. The individual will serve as the technical lead and architect of an agile team. They will develop, maintain and enhance the components and perform installation, maintenance, and deployment of the COTS product, making configuration changes as needed. In addition, they will be responsible for fiscal year planning activities, user story prioritization for agile sprint cycles, architectural design decisions, and triaging customer problems as needed.<br>Prior knowledge of cloud technologies is mandatory. The Systems Engineer will interface with the development teams during deployments or troubleshooting. The successful candidate will work with new and existing customers to ensure authentication and identity propagation requirements are satisfied. The individual will provide ad hoc support to project-related activities as needed and tasked by management, and will work with project management to prioritize multiple customer stories and tasking when conflicts arise. This work requires significant interaction across many customers and groups and other Service Providers to understand requirements, assess enterprise capabilities that fulfill these needs, and ensure services are compliant with customer's governance.",
            "sourceDate": "01/24/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1) Demonstrated experience with development and/or maintenance of large scale enterprise programs which include the integration of COTS solutions<br>2) Demonstrated experience with Amazon Web Services (AWS)<br>3) Demonstrated experience with the Sponsor’s PKI infrastructure and related tools (x.509, OpenSSL, OAuth, LDAP)<br>4) A working knowledge of DevOps tools and technologies such as Jenkins, Rundeck, and Nexus<br>5) A working knowledge of HTTP Gateway concepts, products, or frameworks<br>6) A working knowledge of agile development methodologies and practices including sprint planning, sprint retrospectives, work backlog, user stories, acceptance criteria, etc.<br>7) Demonstrated experience working with the sponsor's auditing and monitoring tools and processes",
            "dueDate": "02/08/2019",
            "id": "I 2019-29760",
            "location": "Reston",
            "mandatory": "1) Demonstrated experience in designing, securing, and automating the deployment of both Windows and Linux environments.<br>2) Demonstrated experience working with software version control tools (Git/GitHub preferred)<br>3) Demonstrated experience writing Linux shell scripts (bash preferred)<br>4) Demonstrated experience in drafting and contributing to a full range of architectural and engineering documentation, such as System Security Plans or other related program documents<br>5) Demonstrated experience with event correlation and root cause analysis skills.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The sponsor is seeking a highly motivated Systems Engineer (SE) to assist with design, development, and deployments to an existing high-profile enterprise API Portal. This individual will bring new ideas and perspectives to an already talented development/engineering team in an agile DevOps environment.<br>Responsibilities include:<br>- New development as well as O&M to existing API Portal<br>- Support and enhancement of DevOps infrastructure<br>- Development of scripts for DevOps-related activities<br>- Deployment and maintenance of both AWS and non-AWS virtual machines<br>- Customization and configuration of COTS products<br>- Customization and configuration of custom web container artifacts<br>- Coordination with senior managers, technical personnel, partners, and customers<br>The sponsor is seeking a strong, multi-disciplinary (well-rounded) engineer who has skillsets in a variety of IT technologies. The candidate will work in an integrated test-driven development environment that is highly reliant on DevOps, AWS, and related emerging technologies. The candidate will be expected to provide independent working ability as well as teamwork skills to provide resilient and creative solutions. Team members are expected to develop new functionality as well as provide recommendations/upgrades to existing systems. The candidate will be responsible for assisting with daily operations and maintenance, which includes assisting with the extension, enhancement, refactoring, and architecture of the existing software and responding to a variety of ad hoc requests.  This position will join an integrated project team and new team members will be expected to work closely with a variety of skill sets, such as Project Managers, System Engineers, Developers, and Architects.",
            "sourceDate": "01/28/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Demonstrated experience with Java Enterprise Edition (JEE) design and development.<br>2. Demonstrated experience with Java open source frameworks, including Spring.<br>3. Demonstrated experience with Java unit testing frameworks.<br>4. Demonstrated experience with the agile software development model.<br>5. Demonstrated experience requesting and installing PKI certificates in the Sponsor's environment.<br>6. Demonstrated experience authoring SQL statements using Oracle.<br>7. Demonstrated experience with provisioning systems, attributes, roles and ETL rules.<br>8. Demonstrated experience and in-depth knowledge of with Secure Socket Layer (SSL) and the various error conditions related to SSL-handshake failures.<br>9. Demonstrated experience with the Git version control system.7. Demonstrated experience with the Git version control system.<br>10. Demonstrated experience interfacing with the various programs in the Sponsor’s access services group.",
            "dueDate": "02/08/2019",
            "id": "I 2019-29761",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience installing and interfacing with LDAP directories.<br>2. Demonstrated experience installing and configuring DevOps tools, specifically Jenkins, Artifactory, Nexus, and Rundeck.<br>3. Demonstrated experience authoring custom Puppet modules and Rundeck jobs.<br>4. Demonstrated experience supporting virtual LDAP directories, ETL processes, and notification-driven update processes.<br>5. Demonstrated experience working with Amazon Web Services, including authoring CloudFormation templates.<br>6. Demonstrated experience working in a Linux environment, including monitoring system resources and authoring bash scripts.<br>7. Demonstrated experience supporting customers in a production environment.<br>8. Demonstrated experience with software architecture and system design for critical, enterprise-grade systems and interfaces.<br>9. Demonstrated experience as the technical lead and architect of a critical enterprise system.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Customer is looking for an energetic, creative resource with excellent skills and a proven track record of successful technical project implementation. The Candidate will work closely with customer’s staff lead for Attribute Service program activities within the Sponsor's office. The individual will serve as the technical lead and architect of an agile team. They will develop, maintain and enhance the components and perform installation, maintenance, and deployment of the COTS product, making configuration changes as needed. In addition, they will be responsible for fiscal year planning activities, user story prioritization for agile sprint cycles, architectural design decisions, and triaging customer problems as needed.<br>Prior knowledge of cloud technologies is mandatory. The Systems Engineer will interface with the development teams during deployments or troubleshooting. The successful candidate will work with new and existing customers to ensure authentication and identity propagation requirements are satisfied. The individual will provide ad hoc support to project-related activities as needed and tasked by management, and will work with project management to prioritize multiple customer stories and tasking when conflicts arise. This work requires significant interaction across many customers and groups and other Service Providers to understand requirements, assess enterprise capabilities that fulfill these needs, and ensure services are compliant with customer's governance.",
            "sourceDate": "01/28/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Knowledge of the project management processes, procedures and tools.<br>2. Experience with the sponsor.",
            "dueDate": "01/30/2019",
            "id": "I 2019-29772",
            "location": "McLean",
            "mandatory": "1. Maintain, repair, and develop operating scripts that facilitate data processing and database ingest.<br>2. Redesigning the system to make more data and GIS functionality directly accessible by customer analysts.<br>3. Imagery and/or experience.<br>4. Analysis experience.<br>5. Lotus Notes experience.<br>6. A working knowledge of the following Microsoft applications:<br> - Access<br> - PowerPoint<br> - Excel<br> - Word<br> - Outlook",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The candidate will be responsible for collecting and analyzing digital network information and working with customers to identify information of interest. The candidate will be responsible for designing information workflows between the information providers and customers, as well as maintaining, repairing, and developing operating scripts to make the information directly accessible by customers.",
            "sourceDate": "01/16/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Demonstrated experience with test driven development.<br>2. Demonstrated experience with indexing technologies, such as Solr/Elastic Search.<br>3. Demonstrated experience translating user requirements into technical designs.<br>4. Demonstrated knowledge and experience with automated provisioning technologies or methods such as Amazon Web Services Cloud Formation, Puppet, Chef, Ansible, or AWS bootstrapping via cloud-init scripts.<br>5. Demonstrated experience with scripting languages (e.g. Shell, Perl, and Python) experience and/or ability to automate routine operations through scripts or tool sets. <br>6. Strong written and oral communication skills.",
            "dueDate": "02/07/2019",
            "id": "I 2019-29791",
            "location": "Reston",
            "mandatory": "1. Demonstrated knowledge and experience with creating an enterprise software application architecture framework and software application design and workflow using the best technology solution to include the security protection and monitoring for the application layer.<br>2. Demonstrated experience with Ruby on Rails<br>3. Demonstrated experience working with relational database systems such as MySQL (other on-the-job relational database experience accepted).<br>4. Demonstrated experience writing RESTful web services.<br>5. Demonstrated experience with Java application development/software engineer experience working with front end technologies such as JavaScript framework, HTML, CSS, Angular. <br>6. Demonstrated knowledge and experience with scripting such as JavaScript, Bash, and Typescript<br>7. Demonstrated knowledge and experience writing unit test and working with testing frameworks like Junit, Karma and Jest.<br>8. Demonstrated experience working with DevOps tools such as GIT, Jenkins, and Nexus.<br>9. Demonstrated experience working with Amazon Web Services (AWS).",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is seeking a Software Engineer that provides front-end development support to an ExtJS UI and back-end Ruby on Rails web application that provides social bookmarking and collaboration capabilities.<br>Duties include, but not limited to:<br>• Analyze and study complex system requirements.<br>• Design software tools and subsystems to support software reuse and domain analyses and manage their implementation.<br>• Translate detailed design into computer software. Implement COTS packages.<br>• Test, debug, and refine the computer software to produce the required product.<br>• Prepare required documentation, including both program-level and user-level documentation.<br>• Enhance software to reduce operating time or improve efficiency.<br>• Provide technical guidance in software engineering techniques and automated support tools.<br>• Provide technical direction to programmers to ensure program deadlines are met.",
            "sourceDate": "01/25/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience with PingFederate and PingDirectory COTS product or commitment to obtain vendor training within 3 months.<br>2. Demonstrated experience with DevOps components such as<br>GitHub, Jenkins, or Artifactory.<br>3. Demonstrated experience with large-scale enterprise programs and networking of large scale DBMS and software services.<br>4. Demonstrated experience with risk management from the perspective of effectively identifying, citing, ranking, and establishment of appropriate mitigation approaches.<br>5. Demonstrated experience adjudicating competing priorities, incorporating user requirements into technical project road-maps/schedule, and providing analysis of alternatives for capability enhancements to better enable customer lead project decisions.<br>6. Demonstrated experience developing architectural and engineering patterns and maturity models.<br>7. Demonstrated experience with developing, drafting and presenting program documentation (Concept of Operations, Implementation Plans, etc) to communicate with stakeholders.<br>8. Demonstrated experience working with stakeholders and technical team members to identify and shape solutions that meet both performance and Information Assurance requirements.",
            "dueDate": "02/07/2019",
            "id": "I 2019-29792",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience working with development teams using an agile methodology.<br>2. Demonstrated prior experience with operations and maintenance of enterprise applications in a cloud environment.<br>3. Demonstrated experience supporting implementations of authentication and authorization, to include customer governance, policy definitions, policy management and automation, and customer interfaces used to deliver integrated security solutions across multiple security domains (networks, enterprise, enclaves).<br>4. Demonstrated experience with XML.<br>5. Demonstrated experience using Lightweight Directory Access Protocol (LDAP) services for authentication.<br>6. Demonstrated experience maintaining enterprise applications on both Linux and Windows platforms.<br>7. Demonstrated experience with PKI certificate integration.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Customer is looking for an energetic, creative resource with excellent skills and a proven track record of successfully leading teams of engineers responsible for the Operations and Maintenance (O&M) of enterprise applications. This position is for a software engineer with deep, broad technical knowledge and experience with the Customer IT environment (architecture, applications, technologies, and infrastructure). The Candidate will work closely with customer’s staff lead for Authentication program activities within the Sponsor's office. The engineer will lead the O&M team to integrate, test, and deploy COTS components. The engineer will oversee the maintenance and enhancement of the Sponsor components and supervise installation, maintenance, and deployment of the COTS product, making configuration changes as needed.<br>Prior knowledge of authentication and authorization is helpful as is experience with cloud environments. The engineer will lead the infrastructure teams performing deployments or troubleshooting. The individual will provide ad hoc support to project-related activities as needed and tasked by management, and will work with project management to prioritize multiple customer stories and tasking when conflicts arise. This work requires significant interaction across many customers and groups and other Service Providers to understand requirements, assess enterprise capabilities that fulfill these needs, and ensure services are compliant with customer's governance. <br>The engineer will lead the O&M team to integrate, test, and deploy COTS components. The software engineer will oversee the maintenance and enhancement of the Sponsor components and supervise installation, maintenance, and deployment of the COTS product, making configuration changes as needed.",
            "sourceDate": "01/25/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience using the Sponsor’s Help Desk Suite or Remedy.<br>2. Demonstrated experience with the sponsor’s enterprise architecture.<br>3. Demonstrated experience utilizing development software such as C++<br>Document Object Model DOM Scripting<br>Simple API for XML SAX<br>Sun Microsystems’ Java.<br>4. Manages time efficiently and multi-tasks effectively.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29795",
            "location": "McLean",
            "mandatory": "1. Demonstrated experience developing, maintaining and editing SharePoint sites across component organizations.<br>2. Demonstrated experience developing website user interfaces using script libraries and SharePoint Designer tools.<br>3. Demonstrated experience interpreting and translating business requirements to product development.<br>4. Demonstrated experience developing client side code for web applications using HTML, jQuery, JavaScript, CSS, PHP and other technologies.<br>5. Demonstrates ability to work and conduct research independently.<br>6. Demonstrated experience troubleshooting and supporting IT equipment such as PCs, printers, and scanners supported by programs to include MS Windows, OMNIpage/similar scanning software, MS Office, and Internet Explorer.<br>7. Demonstrate experience working with a broad spectrum of support teams to facilitate and manage customer requirements/projects.<br>8. Demonstrated experience providing support to a senior level customer base in person, via remote sessions, and over the phone.<br>9. Demonstrated experience documenting weekly project status and participating in project status briefings and discussions.<br>10. Demonstrated experience in the use of Microsoft Office Suite and Windows Servers.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "•Design, develop and modify software systems, using scientific analysis and mathematical models to predict and measure outcome and consequences of design.<br>•Develop and direct software system testing and validation procedures, programming, and documentation.<br>•Confer with systems analysts, engineers, programmers and others to design system and to obtain information on project limitations and capabilities, performance requirements and interfaces.<br>•Correct errors by making appropriate changes and then recheck the program to ensure that the desired results are produced.<br>•Conduct trial runs of programs and software applications to be sure they will produce the desired information and that the instructions are correct.<br>•Compile and write documentation of program development and subsequent revisions, inserting comments in the coded instructions so others can understand the program.<br>•Write, update, and maintain computer programs or software packages to handle specific jobs, such as tracking inventory, storing or retrieving data, or controlling other equipment.<br>•Consult with managerial, engineering, and technical personnel to clarify program intent, identify problems, and suggest changes.<br>•Perform or direct revision, repair, or expansion of existing programs to increase operating efficiency or adapt to new requirements.<br>•Write, analyze, review, and rewrite programs, using workflow chart and diagram, and applying knowledge of computer capabilities, subject matter, and symbolic logic.<br>•Write or contribute to instructions or manuals to guide end users.<br>•Investigate whether networks, workstations, the central processing unit of the system, or peripheral equipment are responding to a program's instructions.<br>•Prepare detailed workflow charts and diagrams that describe input, output, and logical operation, and convert them into a series of instructions coded in a computer language.<br>•Consult with and assist computer operators or system analysts to define and resolve problems in running computer programs.<br>•Assign, coordinate, and review work and activities of programming personnel.<br>•Collaborate with computer manufacturers and other users to develop new programming methods.<br>•Train subordinates in programming and program coding.<br>•Designs, Develops, and Maintains applications within the cloud environment. This can be for new applications development or the transition of legacy applications to the cloud environment.<br>•Design and develop tools for the MS Windows and relevant operating system platforms.<br>•Design and develop tools that integrate with commercial applications.<br>•Design and develop database management systems, image processing, collaborative tools, data manipulation techniques, data visualization techniques, and directory services.<br>•Provide database architectural and design capabilities.<br>•Develop unit and functional test plan.<br>•Provide the operations and maintenance of operational systems.<br>•Modify existing software to correct errors, allow it to adapt to new hardware, or to improve its performance.<br>•Analyze user needs and software requirements to determine feasibility of design within time and cost constraints.<br>•Consult with customers about software and hardware systems, design and maintenance for problem resolutions.<br>•Coordinate software system installation and monitor equipment functioning to ensure specifications are met.<br>•Maintain record of daily communication and other transactions.",
            "sourceDate": "01/15/2019",
            "title": "SharePoint Developer"
        },
        {
            "desired": "1. Demonstrated experience with Apache.<br>2. Demonstrated experience with Jenkins.<br>3. Demonstrated experience with Amazon Web Services (AWS) is strongly desired.<br>4. Demonstrated experience creating and modifying shell scripts to automate administrative tasks.<br>5. Demonstrated experience upgrading system infrastructure software and hardware.<br>6. Demonstrated system integration experience with the Sponsor’s PKI infrastructure (certificate lifecycle management).",
            "dueDate": "01/30/2019",
            "id": "I 2019-29814",
            "location": "Chantilly",
            "mandatory": "1) Demonstrated experience with Unix/Linux and Windows operating systems administration or engineering.<br>2) Demonstrated experience with deployment of J2EE applications.<br>3) Demonstrated experience performing O&M support of J2EE environments.<br>4) Demonstrated experience troubleshooting Windows-based and UNIX-based systems.<br>5) Demonstrated experience migrating software baselines from one environment to another to support the development to test to production process.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The System Engineer (SE) will be a part of an established team to deliver solutions for multiple projects. The SE will work in partnership with application development teams and infrastructure support groups to define, deliver and support an application infrastructure for hosting multiple enterprise COTS, and middleware solutions. This SE will be responsible for design, installation, configuration, troubleshooting, problem resolution and support.",
            "sourceDate": "01/16/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Demonstrated experience with one or more of the following development languages: Angular.js, Node.js, Sails.js, and Express.js.<br>2. Demonstrated experience developing Service Oriented Architecture (SOA) applications consisting of HTML applications that connect directly to several micro-services.<br>3. Demonstrated experience with No SQL databases, such as Mongo database.<br>4. Demonstrated experience with development or integration of technical solutions utilizing Amazon Web Services (AWS) cloud capabilities.<br>5. Demonstrated experience developing in the DevOps environment, providing operations and maintenance, and integration support.<br>6. Bachelor's degree in Information Technology, Computer Sciences or Engineering.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29816",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience developing medium to complex mission oriented web based applications and systems. Experience should also include operations and maintenance (O&M) support.<br>2. Demonstrated experience with Ruby on Rails application development, testing, and code deployment techniques.<br>3. Demonstrated experience with MySQL relational database system.<br>4. Demonstrated experience developing on Linux platforms.<br>5. Demonstrated experience with Scrum (or similar) Agile development methodology.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The sponsor organization is seeking an applications developer to provide full development and O&M support for multiple Ruby on Rails web applications supporting the Sponsor’s senior staff offices.  The candidate will be expected to do the following:<br>\t<br>• Analyzes customer needs and develops software solutions.<br>• Design and develop enterprise applications in various environments and networks.<br>• Develop, create, and modify computer application software or specialized utility programs.<br>• Design software or customize software for customer use with the aim of optimizing operational efficiency.<br>• Perform reviews of work products for correctness, adherence to the design concept and user standards.<br>• Assist with determining level of effort of tasks to be worked and deliver work products within agreed upon schedule.<br>• Assist with supporting Operation and Maintenance activities.",
            "sourceDate": "01/15/2019",
            "title": "Applications Developer"
        },
        {
            "desired": "1. Bachelor Degree in an Engineering or Computer Science discipline.<br>2. Demonstrates a knowledge of Data management and data concepts, including OLTPs, Data Warehouses, ETL, and simple SQL.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29822",
            "location": "Reston",
            "mandatory": "1. Demonstrated system engineering experience with developing, upgrading and/or migrating large scale enterprise projects to an AWS private cloud hosting environment.<br>2. Demonstrated/academic/training experience with an understanding of Agile methodology, SOA and ‘Cloud’ architectures, information sharing, data base repositories and collaboration technologies (wiki / blog), and Microsoft tools (e.g., MS Office, MS Project and MS Visio).<br>3. Demonstrated experience providing support to development and operations projects. This support includes user and system requirements collection, analysis, definition and documentation, tracking the status of project activities, identifying strengths and weaknesses of solutions, and verifying deliverables.<br>4. Demonstrated experience exhibiting oral and written communication skills, with the demonstrated ability to communicate complex technical topics to Sr. management and non-technical audiences. This includes facilitating discussions and leading conversations.<br>5. Demonstrated duties that will support the planning, scheduling, reporting and coordination of team and customer meetings, identify and track issues, risks, and mitigation strategies. Support communications with customers, other stakeholders, and service delivery partners.<br>6. Project management certification.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is looking for an IT System Engineer (SE) to join its Infor- Lawson ERP upgrade and cloud migration project located in Northern Virginia. This high visibility project will provide for an upgrade and migration of the ERP application and system by the ERP Vendor to a more sustainable system. The Sponsor needs the services of an independent self-starter who will work hand-in-hand with and provide timely technical support to the Sponsor’s Program Manager. The selected SE will provide a valuable interface with the Sponsor’s “Customers” who will need to participate fully by providing and validating user requirements, and the Sponsor’s “Vendor” to provide an independent verification of the Infor Upgrade implementation, architecture and risk management plans. The SE will also interface with the Sponsor’s Senior Managers, and Sponsor’s onsite technical personnel. Bottom-line is that the SE will work with both the Sponsor and the Sponsor’s partners and customers to coordinate and verify the development and implementation of the Sponsor’s Infor-Lawson ERP upgrade and cloud migration project.<br>In addition, the selected IT System Engineer will maintain a strong awareness of technical trends in information technology, develop and maintain a strong awareness of on-going IT projects and their interfaces, and business unit requirements; be able to work within the Vendor’s project management model (e.g. Spiral, Waterfall, Agile) selected for a given development effort; and provide analysis, design, development, deployment, and lifecycle support for proposed cloud-based system and application solutions. Work involves being able to develop end-to end system analysis; ensure systems being developed comply with the enterprise technical reference architecture; help project and program teams prepare for program control gates; and keep senior management apprised of any project risk and the associated risk strategy.",
            "sourceDate": "01/15/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Demonstrated experience with Virtual private network (VPN) solutions.<br>2. Demonstrated experience with content management systems (such as Liferay, Joomla, wiki).<br>3. Demonstrated experience as a self-starter that is organized and continually cognizant of newly released technologies in the commercial environment.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29826",
            "location": "Chantilly",
            "mandatory": "1. Demonstrated experience building and maintaining web sites with modern frameworks (WordPress, HTML, JavaScript, jQuery, Angular, Bootstrap, etc.).<br>2. Demonstrated experience procuring and administering domains, web hosting and email from commercial internet providers.<br>3. Demonstrated experience using commercial email, office and file storage services.<br>4. Demonstrated experience with Microsoft Office programs (Word, PowerPoint, and Excel).<br>5. Demonstrated experience or understanding of Agile methodologies and tools.<br>6. Demonstrated experience creating technical documentation and standard operating procedures.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is looking for an IT Program Manager to join our web development and engineering team. This position entails working on extremely forward leaning, mission critical, and advanced applications. The selected candidate will work cohesively with a team comprised of engineers, developers, program managers, and customer support specialists to assist with the documentation, research, procurement of commercial services, development and support of custom communications solutions. The candidate will also need to communicate with non-technical users and document technical solutions.<br>The selected candidate’s responsibilities will include the following:<br>• Research, procure, integrate and support commercial communication services.<br>• Research cyber subjects of interest and report on all findings orally and in writing as required.<br>• Creating documentation for the Information Security Certification and Accreditation (C and A) process.<br>• Develop standard operations procedures for all of the team’s activities.<br>• Support the operation of the team’s solutions.<br>• Decomposing high-level business and user requirements.<br>• Respond to requests for information (RFIs) from the Sponsor’s customers.<br>• Coordinate, support, and participate in program meetings and project reviews with all leadership levels among Sponsor’s Partners.<br>• Utilizing critical thinking skills to proactively identify programs, efficiencies, and new opportunities for partnership.",
            "sourceDate": "01/15/2019",
            "title": "IT Program Manager"
        },
        {
            "desired": "1. Project Manager Professional (PMP) Certification.<br>2. Demonstrated experience with oral and written communication skills – the ability to communicate information and ideas in a manner that is understandable, responsive, and customer-focused.<br>3. Demonstrated experience identifying the strengths and weaknesses of alternative solutions, conclusions or approaches to problems.<br>4. Demonstrated experience identifying complex problems and reviewing related information to develop and evaluate options and implement solutions.<br>5. Demonstrated experience in providing customer service.<br>6. Demonstrated experience in planning and scheduling, to include experience in developing program plans, resource requirements, and schedules to achieve Program goals.<br>7. Demonstrated experience working with Microsoft Office to include PowerPoint, Excel, Word, and Outlook.<br>8. Demonstrated knowledge of the domain area for this role: Identity and Access Management and/or knowledge of IC ITE service provider activities.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29834",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience in developing program plans, resource requirements, and schedules to achieve Program goals.<br>2. Demonstrated experience implementing streamline processes and procedures for established programs.<br>3. Demonstrated experience with project management, to include project management processes and project management life cycle/control gates.<br>4. Demonstrated experience with technical integration projects requiring technical depth and skills.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Customer Experience Manager (CXM) is in charge of leading the design, execution, and delivery of a best-in-class Customer Experience for client’s enterprise access control division<br>The Customer Experience Manager for these services is accountable for working directly with leadership to develop the Enterprise strategy for all customer interactions and driving the development of service adoption as well as assisting with the development of the Customer Experience department's overall strategy execution.<br>Candidate will be expected to partner with functional areas, service providers, and sponsored counterparts to drive customer experience results within the scope of account abilities. Individual will be responsible for working closely with both internal teams and our customers too quickly and effectively promote services, track requirements, and resolve issues. You will have the opportunity to work in a cross-functional capacity with other service providers and to promote a culture of continuously improving client services and lead the experience where Enterprise services become the preferred choice for the customer.<br>PRIMARY JOB DUTIES AND RESPONSIBILITIES<br>•Strong IT background and solid communication skills. Candidate will be expected to brief customers and recommend Enterprise solutions for access control requirements.<br>•Partner with internal IT resources to achieve agreed upon services/products/processes.<br>•Support daily CXM operations by monitoring support channels to ensure exemplary and timely response.<br>•Support the CXM team in working to address and resolve client issues, either through direct, personal action or by promoting quick and results-driven collaboration with other relevant parties.<br>•Work with the sponsor lead and team members to identify areas for process improvements—thereby, leading the team on correcting/optimizing these areas quickly and efficiently.<br>•Assist with the creation, implementation, and training of client experience best practices and playbooks.<br>•Gather and assess customer feedback to aid in tracking and reporting key client experience metrics.<br>•Developing cohesive recommendations to functional areas based on feedback. Partnering with functional areas to implement recommendations.<br>•Partner with sponsor lead to develop marketing strategy and collateral related to Customer Experience improvements, ensuring that customers recognize and value exceptional products and service offerings.",
            "sourceDate": "01/15/2019",
            "title": "IT Program Manager"
        },
        {
            "desired": "1. An understanding of social media platforms and use.<br>2. Experience with Agile methodology, requirements management, and use of JIRA.<br>3. Demonstrated experience in operating independently at senior levels across organizations and at the working level by bringing large groups to consensus through facilitation.",
            "dueDate": "01/31/2019",
            "id": "I 2019-29836",
            "location": "McLean",
            "mandatory": "1. Demonstrated experience assessing current and future needs, technology advancements and trends.<br>2. Demonstrated experience with problem resolution to include organizing and structuring solutions to complex problems.<br>3. Demonstrated experience creating, drafting, and reviewing program documentation. This includes the ability to plan projects, meet objectives, develop contingencies, and produce schedules.<br>4. Demonstrated experience planning meetings, drafting detailed meeting notes, capturing, <br>disseminating and tracking action items.<br>5. Demonstrated experience with knowledge capture and management<br>document best practices and lessons learned.<br>6. Demonstrated experience working on requirements gathering from multiple user classes.<br>7. Demonstrated experience coordinating and facilitating user requirement sessions, translating use cases into formal requirements for tools and capabilities.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "A new program for the Sponsor, focused on the future of Social Media in analysis, seeks a proven, Senior PM to support Sponsor leadership.  This position involves direct support to the Sponsor's Social Media Program Manager and is a unique opportunity to help envision the future through development of new programs, testing and evaluating commercial technologies, and developing new best practices<br>The candidate will be responsible for providing the Sponsor support in planning, developing, communicating, implementing, and overseeing the program.  The candidate will assist the Sponsor in working programmatic issues and suggest viable solutions and should be prepared to provide recommendations, provide support to pilot programs, develop artifacts, schedules, feedback mechanisms, execute demos, and help lead focus groups.  While there are other team members to assist, duties include:  set agendas, track assigned actions, facilitate control gates, risk analysis, and governance deliverables for the team as well as internal and external customer/stakeholders, support the group’s governance process, facilitate technical and programmatic discussions, track status of major project deliverables, organize meetings on use cases, testing, evaluation, and related topics, capture and disseminate meeting notes and track action items, ensuring they are completed.  Also, this will include assisting with guidance on appropriately completing documentation artifacts, deliverables, and overall program input/management, conducting research to respond to actions or to prepare meetings, conferences, working groups, and/or technical exchanges, ensuring coordination and information flow occur between all programs, stakeholders and organizational managers to include responding to data calls.  Other support will include preparing briefings, assist with capture of minutes from ad hoc meetings, and formulation of talking points.",
            "sourceDate": "01/17/2019",
            "title": "Program Manager"
        },
        {
            "desired": "1. Experience with web/application technologies such as Tomcat, Apache, Weblogic, memcache.<br>2. Experience with scripting and programming languages such as YAML, JSON, Bash, Python, PERL and Java.<br>3. Experience supporting a team of developers, testers, DBAs, SAs, and engineers.<br>4. Experience with supporting a mission critical system with a 24x7 rotational pager and providing on-call support when necessary.<br>5. Experience supporting/attending TRRs, DRRs, TEMs, and application/infrastructure deployments during business and off-hours when necessary.<br>6. Experience with Oracle technologies, Oracle 12c, or Golden Gate, or Data Guard or OEM.<br>7. Experience with vulnerability scanning tools.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29838",
            "location": "Herndon",
            "mandatory": "1. Experience with Cloud technologies and AWS services.<br>2. Experience with networking technologies such as VPC, Private VPCs, SubNets, Openvpn, switches, routers, ASAs/FWs, subnetting, VLANs, VTP, routing tables, host based firewalls (iptables, and firewalls).<br>3. Experience with storage technologies such as: ELBs, S3’s, Glacier, SAN, SCSI, FIBER, logical volumes, and volume groups.<br>4. Experience with PKI/SSL/TLS architecture, configuration and the ability to create requests and install 3rd party certificates for different technologies (windows, linux, COTs and custom applications).<br>5. Experience with Active directory tools and services such as Windows Active directory, LDAP, and Centrify.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The SE in this position will provide the technical direction, guidance and the management/coordination of software trends, tools, and analysis.<br>The SE will analyze, design, plan, define and document the artifacts in support of: Networks, VPCs, Storage, Audit, security and data management requirements.<br>The SE will take a proactive role in coordinating and managing customer touch points, dependencies, security requirements, and environmental standards, assuring that the system is in compliance and up to date on software/hardware services, tools and server software.",
            "sourceDate": "01/15/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Demonstrated experience developing and maintaining applications in the Sponsor’s organization.<br>2. Demonstrated experience with code delivery mechanisms, such as Maven or Ant.<br>3. Demonstrated experience with code repositories, such as Subversion or Git.<br>4. Demonstrated experience with continuous delivery solutions, such as Hudson, Jenkins, or Puppet.<br>5. Demonstrated on-the-job experience with SOLR.<br>6. Demonstrated on-the-job experience with Cassandra.<br>7. Demonstrated on-the-job experience developing web UIs using Angular.",
            "dueDate": "01/31/2019",
            "id": "I 2019-29841",
            "location": "Herndon",
            "mandatory": "1. Demonstrated experience with Java development skills (within the last 3 years) using Spring and Hibernate or REST services.<br>2. Demonstrated experience with SQL database development skills (e.g. MySQL, Oracle, etc.) within the last 5 years.<br>3. Demonstrated experience working as a full time Software Developer on a large team, developing complex applications with large customer bases.<br>4. Demonstrated experience in web development, such as JavaScript or JSON.<br>5. Demonstrated experience with IDE (e.g. Eclipse, or NetBeans) within the last 5 years.<br>6. Demonstrated experience developing within an Agile environment.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "A software engineer shall provide some software development and software design support to build a complex web-based architecture.<br>Responsibilities include, but not limited to:<br>• Develop and implement Web applications and/or web services using object-oriented programming with a focus on building RESTful services to support the User Interface (UI), the middle tier, as well as implementing support for SQL.<br>• Work with Systems Engineers and Developers to develop detail designs and translate and decompose requirements to a web based architecture.<br>• Act as an adviser to IT System Engineers/Developers and propose changes to the enterprise technical architecture based on analysis of requirements and new technology.<br>• Provide technical leadership in a software development team environment.<br>• Work both independently and in an Agile team environment.<br>• Design software tools and sub-systems to support software reuse and domain analysis and manage their implementation.<br>• Assist in the development of methodologies and techniques that will be used by other developers to solve specific problems.<br>• Assist in the development of coding standards and participate in code reviews and code walk through.<br>• Troubleshoot and problem solve both technical and non-technical issues.<br>• Analyze and study complex system requirements.",
            "sourceDate": "01/17/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience working with VMware.<br>2. Demonstrated experience building applications that use biometric technology.<br>3. Demonstrated experience with Natural Language Processing libraries.<br>4. Demonstrated experience developing the database engine not provided under the mandatory skills. (Oracle or Microsoft database engines)",
            "dueDate": "01/31/2019",
            "id": "I 2019-29843",
            "location": "Herndon",
            "mandatory": "1. Demonstrated experience in software engineering across the full development life-cycle to include software development, planning, and architecture.<br>2. Demonstrated experience developing for and managing Oracle or Microsoft database engines.<br>3. Demonstrated experience building applications on the Microsoft software stack, to include .NET, VBScript, C#, and Microsoft SQL Server.<br>4. Demonstrated experience working with both Linux and Microsoft servers, with strong experience scripting in both Bash and PowerShell.<br>5. Demonstrated experience configuring and deploying to both Microsoft IIS and open source web servers, such as Apache HTTPD, or Apache Tomcat.<br>6. Demonstrated experience architecting software solutions that span multiple networks in a sponsor partner's environment.<br>7. Demonstrated experience architecting and building infrastructure on the Amazon Web Services cloud. This should include server deployment automation, server bootstrap scripts, and implementation of DevOps best practices.<br>8. Demonstrated experience creating objects in Microsoft Active Directory through API calls.<br>9. Amazon Web Services training or certifications.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The customer requires a candidate to provide immediate impact to a growing team building enterprise automation software.  The candidate will program in both .NET and Java, and will work with SQL across multiple database engines.  The candidate is expected to work with both Linux and Microsoft Windows based operating systems, as the candidate will be building and deploying systems to multiple operating systems.  A qualified candidate is expected to write both Bash and PowerShell scripts, and work with DevOps tools to include Artifactory and Jenkins.  The candidate will be engaged with emerging technologies to include Cloud, Infrastructure as code, and many others.",
            "sourceDate": "01/17/2019",
            "title": "Software Developer (Systems Software)"
        },
        {
            "desired": "1. Demonstrated experience working with the Sponsor’s Risk Management Framework (RMF), Assessment & Authorization (A&A) process and information assurance.<br>2. Demonstrated experience participating or leading technical exchange meetings and application review boards and documenting actions items/results of these events.<br>3. Demonstrated experience in penetration testing information systems, to include cloud-based systems and applications.<br>4. Bachelor or Master's degree in a technical field and/or CISSP (or similar certification), CEH, or CHFI certifications.",
            "dueDate": "01/30/2019",
            "id": "I 2019-29846",
            "location": "McLean",
            "mandatory": "1. Demonstrated expertise in recommending best practices in security architecture that promotes cost-effective and efficient systems solutions consistent with program objectives and measures of performance.<br>2. Demonstrated proficiency in drafting Security Assessment Reports and providing threat analysis based on identified security vulnerabilities discovered during review of security plans, interviews with developers/customers, and assessment of information systems.<br>3. Demonstrated proficiency in testing security architectures of cloud-based systems and applications, identifying vulnerabilities and providing security remediation.<br>4. Demonstrated expertise in identifying and applying the appropriate level of recommended remediation to security anomalies or integrity loopholes such as system weakness or vulnerabilities.<br>5. Demonstrated experience and ability to independently download, install, run, and understand software, to include compliance-oriented software for system testing to include: WebInspect, AppDetective, Red Seal, Splunk, and NESSUS.<br>6. Demonstrated experience developing and documenting security evaluation test plans and procedures.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The selected candidate will act as a Cyber Security Project Engineer with experience in systems engineering, application development and information security to include implementing the Risk Management Framework (RMF) and Assessment & Authorization (A&A) of IT systems. The candidate will be directly involved in processing all customer efforts through the various facets of the RMF and A&A process. The candidate will conduct comprehensive cyber assessments of the management, operational, and technical security controls employed within or inherited by an information system to determine the overall effectiveness of the controls (i.e., the extent to which the controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting the security requirements for the system). The candidate will be expected to perform cyber assessments independently, as well as part of a team.  The candidate will also provide an assessment of the severity of weaknesses or deficiencies discovered in the information system and its operational environment and recommend corrective actions to address identified vulnerabilities.",
            "sourceDate": "01/16/2019",
            "title": "Cyber Security Project Engineer"
        },
        {
            "desired": "1. Demonstrated experience working with the Sponsor’s Risk Management Framework (RMF), Assessment & Authorization (A&A) process and information assurance.<br>2. Demonstrated experience participating or leading technical exchange meetings and application review boards and documenting actions items/results of these events.<br>3. Demonstrated experience in penetration testing information systems, to include cloud-based systems and applications.<br>4. Bachelor or Master's degree in a technical field and/or CISSP (or similar certification), CEH, or CHFI certifications.",
            "dueDate": "01/29/2019",
            "id": "I 2019-29848",
            "location": "McLean",
            "mandatory": "1. Demonstrated expertise in recommending best practices in security architecture that promotes cost-effective and efficient systems solutions consistent with program objectives and measures of performance.<br>2. Demonstrated proficiency in drafting Security Assessment Reports and providing threat analysis based on identified security vulnerabilities discovered during review of security plans, interviews with developers/customers, and assessment of information systems.<br>3. Demonstrated proficiency in testing security architectures of cloud-based systems and applications, identifying vulnerabilities and providing security remediation.<br>4. Demonstrated expertise in identifying and applying the appropriate level of recommended remediation to security anomalies or integrity loopholes such as system weakness or vulnerabilities.<br>5. Demonstrated experience and ability to independently download, install, run, and understand software, to include compliance-oriented software for system testing to include: WebInspect, AppDetective, Red Seal, Splunk, and NESSUS.<br>6. Demonstrated experience developing and documenting security evaluation test plans and procedures.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The selected candidate will act as a Cyber Security Project Engineer with experience in systems engineering, application development and information security to include implementing the Risk Management Framework (RMF) and Assessment & Authorization (A&A) of IT systems. The candidate will be directly involved in processing all customer efforts through the various facets of the RMF and A&A process. The candidate will conduct comprehensive cyber assessments of the management, operational, and technical security controls employed within or inherited by an information system to determine the overall effectiveness of the controls (i.e., the extent to which the controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting the security requirements for the system). The candidate will be expected to perform cyber assessments independently, as well as part of a team.  The candidate will also provide an assessment of the severity of weaknesses or deficiencies discovered in the information system and its operational environment and recommend corrective actions to address identified vulnerabilities.",
            "sourceDate": "01/15/2019",
            "title": "Cyber Security Project Engineer"
        },
        {
            "desired": "1. Good working knowledge of using XML within Java<br>2. Understanding of Java multithreaded processes <br>3. Experience with AWS and/or AWS developer or solution architect certified<br>4. Experience with ORACLE or SQL Data Base.<br>5. Experience using Spring boot/Hibernate.",
            "dueDate": "02/05/2019",
            "id": "I 2019-29854",
            "location": "Herndon",
            "mandatory": "1. Experience with cloud technologies and services <br>2. Experience with Groovy/Grails, Java8 + Spring Boot.<br>3. Experience with markup languages such as (XML, JSON, or YAML)<br>4. Experience with JPA/SQL - how to use/optimize a JPA/Hibernate framework, good working knowledge of SQL<br>Distributed software architectures/microservices<br>5. Experience with and employing basic: Git/Github, DevOps <br>6. Experience with Agile methodology process for managing and producing workable code.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The resource will be part of a larger team that supports systems and applications in the cloud environment. The new team member will be expected to provide standard developmental duties as assigned including but not limited to analysis, design, coding, testing, and trouble shooting. Eventual on call pager duty will be expected.   Technical expertise and input is expected, team work, collaboration, and communication are key values.    <br>We value all team members input and guidance we desire recommendations and options, we are all stronger together than individually.",
            "sourceDate": "01/23/2019",
            "title": "Applications Developer"
        },
        {
            "desired": "1. Demonstrated experience in developing comprehensive business processes in order to support deployment of new systems.<br>2. Demonstrated experience supporting full IT lifecycle implementation including requirements gathering, process analysis, development, test planning, standard operating procedure creation, knowledge transfer to ongoing operations support teams, monitoring, controlling, and customer support.<br>3. Demonstrated experience of SCRUM methodology for software development projects.",
            "dueDate": "01/31/2019",
            "id": "I 2019-29858",
            "location": "McLean",
            "mandatory": "1. Demonstrated experience developing custom applications, integrating COTS products, and displaying data into visualization tools for knowledge discovery purposes.<br>2. Demonstrated experience compiling, building, and packaged open source software tools for Linux environments.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Provide strategic and technical activities to support the development of a Sponsor integrated data management architecture baseline aligned with Sponsor and Sponsor's partners data management activities, identify opportunities to integrate new data management and analytic technologies to enhance data discoverability, and provide technical guidance to drive Sponsor cloud adoption. Work across stakeholders to enable discovery of new insights and deliver increased mission value through trusted access to Sponsor-collected or acquired data.",
            "sourceDate": "01/17/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience with JavaScript.<br>2. Working knowledge or ability to learn Photoshop. Vendors -please provide a training plan. <br>3. Demonstrated experience with Adobe Flash. <br>4. Working knowledge or ability to learn MS SharePoint. Vendors -please provide a training plan.<br>5. Demonstrated experience working independently and as a part of a team.",
            "dueDate": "02/06/2019",
            "id": "I 2019-29860",
            "location": "Tyson's",
            "mandatory": "1. Demonstrated experience with designing and developing customer web sites and interactive applications. <br>2. Demonstrated experience with CSS and HTML. <br>3. Demonstrated experience and ability to interpret customer requirements, define project goals, determine scope, and develop production timelines and schedules.<br>4. Working knowledge or ability to learn JOOMLA. Vendors -please provide a training plan.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor has an immediate opening for a creative, energetic individual to serve in the position of a Web Applications Developer of various creative and innovative technical enhancements related to adult learning solutions. This position offers the opportunity to develop quick turn-around web sites, provide web and tools integration support for multimedia web based training applications, and maintain several small custom workflow systems and applications for various customers. The Developer will enhance and maintain systems developed in JOOMLA, HTML, XHTML, XML, Flash, and other applications, and assist in migrating these applications to other application platforms, if needed. The officer shall design, develop and implement online media elements and interactions that support communication, learner interaction, and learner assessment, as well as online tools that enable course facilitators to track learner performance. The Designer/Developer will ensure that all products meet or exceed the quality standards and expectation of the Customer. The Designer/Developer shall make technical adjustments during implementation of products, as necessary, to ensure interoperability and functionality. Any necessary tweaks -- to the technical environment, storyline and/or content -- based on student feedback and/or instructor observation will be made to improve the learner's and the instructor's experience. The candidate shall support courses, in this capacity, as directed by Sponsor. <br>The candidate shall also: <br>•\tProvide multimedia support in design, development and delivery for various software products. <br>•\tParticipate in requirements gathering sessions for multimedia activities and other meetings required by the customer. <br>•\tProvide reports, charts, reference material, training modules, courseware and multimedia presentations and demonstrations at the customer’s request. <br>•\tProvide multimedia support in design, development and delivery for various software products.<br>•\tProvide all material related to courseware, such as reports, charts, reference material, etc.<br>•\tSolve complex application development problems. <br>•\tProvide informal technical and administrative direction for personnel performing software development tasks, including the review of work products for correctness, adherence to the design concept and to user standards, and for progress in accordance with schedules. <br>•\tAnalyze the problem and the information to be processed. <br>•\tDefine the problem, and develop system requirements and program specifications, from which programmers prepare detailed flow charts, programs, and tests. <br>•\tCoordinate with programmers to ensure proper implementation of program according to system specifications. <br>•\tDevelop, in conjunction with functional users, system alternative solutions. <br>•\tPrepare test plans and test data to test the proposed system.",
            "sourceDate": "01/24/2019",
            "title": "Web Developer"
        },
        {
            "desired": "1. Experience using DevOps.<br>2. Experience using IBM Maximo.<br>3. Experience working in the sponsors operating environment.<br>4. Knowledge of the sponsors Supply Chain.<br>5. Knowledge of the sponsors PMF.<br>6. Demonstrated experience with Microsoft Office to include SharePoint.",
            "dueDate": "02/05/2019",
            "id": "I 2019-29861",
            "location": "Chantilly",
            "mandatory": "1. Certified Scrum Master.<br>2. Demonstrated experience with Agile Methodology and working on an Agile development team.<br>3. Experience with Agile/Scrum including iterative and incremental development, daily standups, planning, retrospectives, and backlog grooming. <br>4. Demonstrated experience coordinating, planning, and managing application/database builds to development/test/production within each Sprint cycle.<br>5. Demonstrated experience exhibiting communication skills including written, verbal, listening, negotiating, presentation/briefing skills, and working with people at all levels of the organization (customer, vendor, technical).<br>6. Demonstrated experience working independently with minimal supervision while managing multiple responsibilities simultaneously and adjusting to changing priorities.<br>7. Demonstrated experience managing schedules, requirements, technical work and customer needs and expectations.<br> <br>8. Demonstrated experience participating in team meetings, communicating tasks being worked and any impediments\".",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is looking for a Systems Integrator (SI) Scrum Master to work with their sponsor lead and product owner to achieve the objectives of the project they are assigned to. The SI Scrum Master is responsible for the overall management of the agile workflow for the sponsor system and ensuring that the technical solutions and schedules are implemented in a timely manner. The SI Scrum Master is responsible for all aspects of the project including cost schedules, documentation preparation and customer interaction; Ensures that all control gates and agile workflow steps are met on schedule; Performs organizational wide integration planning and interfaces to other functional systems.  <br>In addition:  <br>• Ensures the Product Owner knows how to arrange the Product Backlog to maximize value<br>• Helps the Product Owner, Portfolio Owner and Development Team understand the need for clear and concise Product Backlog items <br>• Grows the understanding and practice of agile within the team<br>• Facilitates Agile events <br>• Removes impediments to the Development Team’s progress <br>• Drives change that increases the productivity of the Team <br>• Works with other Scrum Masters to increase the effectiveness of the application of Agile in the organization.",
            "sourceDate": "01/23/2019",
            "title": "Systems Integrator"
        },
        {
            "desired": "1. Demonstrated experience with Amazon Web Services in the Sponsor's environment.<br>2. Demonstrated experience preparing and leading technical security briefings for the Sponsor's Information Assurance Board.",
            "dueDate": "02/05/2019",
            "id": "I 2019-29865",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience reviewing and authoring System Security Plans (SSP), Security Controls Traceability Matrix (SCTM), and other partner security documentation.<br>2. Demonstrated experience providing security engineering support to customer projects.<br>3. Demonstrated experience writing and reviewing risk assessment and mitigation reports.<br>4. Demonstrated experience providing information assurance support for cross domain systems.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The candidate shall support the Sponsor in a cross domain data transfer and file conversion solutions.The individual for this position will act as an Information Assurance, Certification & Accreditation and Assessment & Authorization for the Sponsor's organization. The candidate will be directly involved in assisting with processing all organizational efforts through the risk management cycle. The candidate will closely coordinate and track risks, accreditation status and reporting status across project teams. The candidate will act as the group level liaison to the Information System Security Manager staff. They will provide the Sponsor organization with Security Architecture guidance and engineering review. The candidate will provide documentation authorship, critical reviews, engineering and project management support for related activities. Finally, the candidate will play an integral role in leading this organization's transition to the cloud infrastructure, and will be expected to work with individual project teams to transition them in a timely and efficient manner.",
            "sourceDate": "01/23/2019",
            "title": "Cyber Security SME"
        },
        {
            "desired": "1. Experience with a workflow manager or product (Apache NiFi, etc.)<br>2. Python programming experience<br>3. Hadoop or Cloudera experience<br>4. Any AWS certification (developer or architect)",
            "dueDate": "02/05/2019",
            "id": "I 2019-29866",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience programming applications in a Linux environment.<br>2. Demonstrated experience with Java development including Spring Boot.<br>3. Demonstrated experience using Devops systems like GitHub, Gradle, Jenkins and Puppet.<br>4. Demonstrated experience with RDBMS’s to include Oracle, MySQL and Postgres covering both database management and query optimization.<br>5. Demonstrated experience with RESTful web services and architecture patterns such as HATEOAS.<br>6. Demonstrated experience with AngularJs, VueJs and ExtJS.<br>7. Demonstrated experience with HDFS & Zookeeper.<br>8. Demonstrated experience developing with search frameworks such as Solr or Lucene including writing queries and optimizing data storage.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is looking for a full stack developer to join one of the Sponsor’s component development teams.",
            "sourceDate": "01/23/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience with Joomla.<br>2. Demonstrated experience working with Moodle<br>3. Demonstrated experience with working with SharePoint.<br>4. Demonstrated experience with working with Sponsor and partner operating system.",
            "dueDate": "02/05/2019",
            "id": "I 2019-29867",
            "location": "Herndon",
            "mandatory": "1. Demonstrated experience working with Qualtrics and Adobe Connect.<br>2. Demonstrated experience serving as a Close Support customer service provider to include troubleshooting service requests and resolving customer issues using service request systems.<br>3. Demonstrated experience of inventory management controlling, maintaining, and tracking audio/visual equipment including, but not limited to, built-in audio and video systems, printers, workstations, VTC equipment, and computer projectors.<br>4. Demonstrated experience moving and handling equipment weighing 50 lbs.<br>5. Demonstrated experience documenting and developing user instructions.<br>6. Demonstrated experience duplicating data and media (CDs, DVDs, hard drives).<br>7. Demonstrated experience managing user accesses.<br>8. Demonstrated experience applying virus protection updates.<br>9. Demonstrated experience researching and making recommendations for technical equipment.<br>10. Demonstrated experience securely maintaining non-networked equipment, such as laptops using software, such as Safe Boot and Windows Admin tools and virus protection.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Customer Services and Information Technology Officers provide Classroom Support and problem resolution for technology products and/or applications. Depending upon the area of assignment, work may include the following activities: technology or systems-related, centralized customer service center functions; developing and improving the processes of a technology customer service center; interfacing daily with representatives from all elements of the Customer to resolve technical issues and outages; identifying, analyzing, and implementing process improvement changes; developing performance measures for the Customer organization; managing the transition of IT service and infrastructure initiatives; providing technical guidance and direction to component close support teams for all new and component specific applications and deployments.<br>Specifically, this position supports the Sponsors training program in providing superior learning experiences, both online and in the classroom, to all officers around the world.<br>• Interface with customers in a team environment.<br>• Utilize strong written and oral communication skills.<br>• Provide online support to include:<br>  o submitting and processing Sponsors access requests<br>  o providing online support for process and troubleshooting Sponsor's Help Desk Suite tickets<br>• Experience with maintaining, troubleshooting, and tracking classroom hardware to include:<br>  o audio/visual equipment<br>  o workstations<br>  o laptop computers<br>  o printers<br>  o video teleconferencing equipment<br>  o audience response systems<br>  o projectors<br>  o faxes<br>  o scanners.<br>• Provide software support to include:<br>  o submit change requests<br>  o install Safeboot on laptops<br>  o build new laptop<br>  o perform DUD disk download<br>  o run monthly laptop anti-virus software.<br>• Familiarization with Customer processes and procedures.<br>• CMA Certified experience.<br>• Support equipment recapitalization.<br>• Demonstrate knowledge with Sponsors Operating System.<br>• Provide support to end-user on a variety of issues.<br>• Identify, research and resolve technical problems<br>• Respond to telephone calls, e-mail, and personnel request for technical support.<br>• Document, track and monitor the problem to ensure a timely resolution.<br>• Draft standards of operating procedures.<br>• Demonstrate experience troubleshooting service requests and resolving IT customer issues.<br>• Responsible for executing a pre-class IT checklist.<br>• Perform Qualtrics ownership issues to include group administration.<br>• Provide VLC Moodle administration to include course creation, course creators, and course instructors.<br>• Provide daily system monitoring of Sponsors training servers.",
            "sourceDate": "01/23/2019",
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "desired": "1. Demonstrated experience with Red Hat and CentOS variants of Linux.<br>2. Demonstrated experience with AWS.",
            "dueDate": "01/28/2019",
            "id": "I 2019-29877",
            "location": "Reston",
            "mandatory": "1. Demonstrated familiarization with DevOps practices (e.g. continuous integration/testing/deployment/delivery).<br>2. Demonstrated experience with controlled interfaces (example: firewall, cross domain service).<br>3. Demonstrated experience working with system developers to develop test plans and procedures.<br>4. Demonstrated experience with server/network design, configuration, troubleshooting, and diagnostic software and tools.<br>5. Demonstrated experience working within an Agile development environment.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The candidate shall support the Sponsor in a cross domain data transfer capability and file conversion solutions. <br>The candidate shall:<br>• Develop or specify standards, methods, or procedures to determine product quality or release readiness.<br>• Develop testing programs for regression testing, negative testing, error or bug retests, or usability.<br>• Develop and define major and minor characteristics of quality including quality metrics and scoring parameters.<br>• Document software defects, using a bug tracking system, and report defects to software developers.<br>• Monitor bug resolution efforts and track successes.<br>• Monitor program performance to ensure efficient and problem-free operations.<br>• Provide feedback and recommendations to developers on software usability and functionality.<br>The candidate will travel to customer sites within the continental US if required; will receive SSM calls for on-site after-hour and/or weekend support; will work with people to provide exemplary customer service in high-pressure situations.",
            "sourceDate": "01/23/2019",
            "title": "Systems Administrator"
        },
        {
            "desired": "1. Demonstrated experience with IT system continuity planning<br>2. Demonstrated experience in ITIL Foundations (v.3) framework<br>3. Demonstrated experience or familiarity in essentials of CMII<br>4. Demonstrated experience or familiarity with Sponsor's IT systems and service processes<br>5. Demonstrated experience working with Sponsor's IT systems and service providers<br>6. Demonstrated experience in technical writing and editing<br>7. Demonstrated experience with project activities requiring scheduling coordination and/or integration across multiple Sponsor’s partners, organizations, or companies.<br>8. Demonstrated experience working with sponsors service providers",
            "dueDate": "02/05/2019",
            "id": "I 2019-29880",
            "location": "McLean",
            "mandatory": "1. Demonstrated experience preparing and reviewing technical and programmatic documentation supporting BCP tenants ensuring accuracy and achievability confirming impacts are identified, understood and communicated.<br>2. Demonstrated experience with processes necessary to establish new IT infrastructure or IT accessibility requirements.<br>3. Demonstrated experience in planning and coordinating activities such as installing, upgrading, or patching hardware and/or software resources.<br>4. Demonstrated experience in identifying potential problem areas with associated configuration items or artifacts and the ability to distinguish and communicate appropriate corrective actions<br>institute necessary monitor controls ensuring configuration item/artifact is reflective of identified activity(s).<br>5. Demonstrated experience in life-cycle support, including maintenance, administration, and management.<br>6. Demonstrated experience with computer systems and gathering/identifying IT requirements.<br>7. Demonstrated experience tracking project studies, plans, actions items, and recording meeting minutes.<br>8. Demonstrated experience with project management activities, including risk, scope, cost, time, quality, communications and resource management.<br>9. Demonstrated experience delivering IT systems engineering lifecycle of IT systems and service processes",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is seeking an IT Program Manager for the purpose of oversight coordination, planning, implementation, and execution of concurrent highly visible, time sensitive, and designated critical systems for multifaceted IT organization. The IT program manager will support the organization’s role as the Sponsor coordinator and representative to partnering organizations. The IT Program Manager will assist with Business Continuity Planning (BCP) and related policies and program. The candidate will identify, inventory, and integrate disparate project requirements for identified business IT and mission IT systems considered critical and/or highly necessary for contiguous business and mission operations into an achievable operational plan expeditiously and efficiently. Additionally, the IT program manager must cultivate and mature effective BCP methodologies fostering continuous process improvement across a multiple service provider environment, ensuring the integrity and availability of organizational information systems while mitigating minimal disruption to business and mission service operations. The IT program manager will interface with multiple groups at all levels of management and workforce personnel.",
            "sourceDate": "01/23/2019",
            "title": "IT Program Manager"
        },
        {
            "desired": "1. Strong ETL experience.<br>2. Demonstrated experience working independently with little oversight/guidance. <br>3. Demonstrated experience working with Tableau and Kibana.<br>4. Demonstrated experience working with Apache Spark.<br>5. Clourera Certified Hadoop Developer",
            "dueDate": "02/06/2019",
            "id": "I 2019-29881",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience working with large-scale enterprise data collections.<br>2. Demonstrated experience working with NetOwl entity extraction in support of identity resolution and screening operations.<br>3. Demonstrated experience working with big data ingest, data modeling, and index/search.<br>4. Demonstrated experience working with big data stores, i.e oracle, Netezza, Solr, and Elasticsearch.<br>5. Demonstrated experience working with JAVA based ETL tooling and processing. <br>6. Demonstrated experience working with Python, XML, JSON, Java.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Provide strategic and technical activities to support the development of a Sponsor integrated data management architecture baseline aligned with Sponsor and Sponsor's partners’ data management activities, identify opportunities to integrate new data management and analytic technologies to enhance data discoverability, and provide technical guidance to drive Sponsor cloud adoption. Work across stakeholders to enable discovery of new insights and deliver increased mission value through trusted access to Sponsor-collected or acquired data.",
            "sourceDate": "01/24/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience in full a life-cycle software development team performing all phases of a rigorous software development methodology with the ability to identify gaps, mitigate technical risk, troubleshoot, and solve complex technical problems.<br>2. Demonstrated experience with Apache Web Server and Apache Tomcat.<br>3. Demonstrated experience with Agile development processes and experience with continuous integration, configuration management, and issue tracking software suites.<br>4. Demonstrated experience documenting system design and architecture.<br>5. Demonstrated experience with written and oral communication skills.<br>6. Demonstrated experience with the Sponsor's networks, governance processes, and C&A processes.",
            "dueDate": "02/06/2019",
            "id": "I 2019-29885",
            "location": "Herndon",
            "mandatory": "1. Demonstrated experience administering and working with AWS to include EC2 and S3 services.<br>2. Demonstrated experience with CentOS Linux to include maintaining the health of servers.<br>3. Demonstrated experience automating processes and configuration updates through scripts and automation frameworks (e.g., Cloud Formation).<br>4. Demonstrated experience establishing and configuring operating system, application, and service monitoring solutions (e.g., Cloud Watch).<br>5. Demonstrated experience assisting developers and troubleshooting and debugging system issues and outages.<br>6. Demonstrated experience designing and implementing systems for redundancy, failover, and zero down time.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is requesting a System Engineer who will work with language technology to implement major capabilities and architecture improvements in the program.  An ideal candidate would be a Systems Engineer with both software development and systems administration skills in a cloud environment.  This individual will have a major impact on the tactical and strategic course of the program.  The program’s work on human language technology is a high-priority and high visibility issue extending into the future.<br>Responsibilities include, but not limited to:<br>• Ensuring daily health of cloud servers and instances. Working with developers to assist in deployments.<br>• Streamline and automate the deployment, maintenance, testing, and monitoring of existing language translation application.<br>• Use understanding of Sponsor enterprise architecture and Sponsor approval/deployment mechanisms to integrate COTS applications and services to leverage existing capabilities or build new capabilities and functionality on multiple intranets and networks to include cloud environments.",
            "sourceDate": "01/24/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Demonstrated experience in the design and implementation of enterprise level web applications using Node, AngularJS, MySQL, Grunt and Gulp.<br>2. Demonstrated experience with Agile development processes and experience with continuous integration, configuration management, and issue tracking software suites.<br>3. Demonstrated experience designing and implementing systems for redundancy, failover, and zero down time.<br>4. Demonstrated experience with written and oral communication skills.<br>5. Demonstrated experience with the Sponsor's governance processes and C&A processes.",
            "dueDate": "02/06/2019",
            "id": "I 2019-29886",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience with networks by working with AWS to include EC2 and S3 services.<br>2. Demonstrated experience with test case creation using an automated testing framework such as karma, protractor and jasmine.<br>3. Demonstrated experience designing, building web applications which integrate with enterprise web services using REST and experience with the JSON data transfer format, preferably in a JavaScript language.<br>4. Demonstrated extensive experience in full life-cycle software development performing all phases of a rigorous software development methodology with the ability to identify gaps, mitigate technical risk, troubleshoot, and solve complex technical problems.<br>5. Demonstrated experience automating processes and configuration updates through scripts and automation frameworks (e.g. Cloud Formation)<br>6. Demonstrated experiences establishing and configuring operating system, application, and service monitoring solutions (e.g. Cloud Watch).<br>7. Demonstrated experience assisting developers and troubleshooting and debugging system issues.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is requesting a Software Engineer who will work with language technology to implement major capabilities and architecture improvements in the program. An ideal candidate would be a Software Engineer with both software development and test automation skills in a cloud environment. This individual will have a major impact on the tactical and strategic course of the program, which is now expanding beyond machine translation to provide any human language technology required to meet mission needs. The program’s work on human language technology is a high-priority and high visibility issue extending into the future.<br>Responsibilities include, but not limited to:<br>• Streamline and automate the deployment and end-to-end testing and monitoring of existing language translation application. <br>• Use understanding of Sponsor enterprise architecture and Sponsor approval/deployment mechanisms to integrate COTS applications and services to leverage existing capabilities or build new capabilities and functionality on multiple intranets and networks to include cloud environments.",
            "sourceDate": "01/24/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience working effectively in a dynamic team environment and with technical and non-technical officers.<br>2. Demonstrated experience coordinating and offering suggestions for concept development, systems specifications, technical exchange, requirements generation, metrics and deployment decisions.<br>3. Demonstrated familiarity with search and discovery technologies and user applications.<br>4. Demonstrated experience with problem resolution to include organizing and structuring solutions to complex problems. This includes the ability to plan projects, meet objectives, develop contingencies, and produce schedules.<br>5. Demonstrated strong coordination and collaboration skills with ability to work successfully across organizational boundaries.<br>6. Demonstrated experience testing end-to-end requirements in applications for operational deployment.<br>7. Demonstrated experience with integrated workflow using current graphic design, desktop publishing and multimedia software packages such as the Adobe Creative Suite (e.g., Photoshop, Illustrator, InDesign, Flash, Premier).<br>8. Demonstrated experience with web technologies such as wikis, blogs, social bookmarking, and crowdsourcing, including developing and editing web content using MediaWiki and WordPress.",
            "dueDate": "02/05/2019",
            "id": "I 2019-29890",
            "location": "McLean",
            "mandatory": "1. Demonstrated experience (within the past 3 years) in an Agile environment and consulting in a multi-project environment.<br>2. Demonstrated experience (within the past 3 years) using JIRA project management software.<br>3. Recent, within the last 3 years, demonstrated experience defining content creation and management workflow and technical requirements.<br>4. Recent, within the last 3 years, demonstrated experience with requirements tracking and management tools.<br>5. Recent, within the last 3 years, demonstrated experience interacting with multi-level stakeholders, development teams, and users.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Sponsor is seeking a Project Integrator who will directly support the Sponsor’s large production application.  This resource will engage mission partners and stakeholders to gather, analyze, and compose technical requirements in support of the development and deployment of a secure, seamless, production system. (For this CSR, the term production system refers to an application that manages the creation and dispensation of written analytic products for the Sponsor.) The candidate will work closely with the Sponsor’s IT partners and the Sponsor’s Program Managers to transform user needs and processes into requirements for system development. The Project Integrator also plays a key role in helping Mission and IT partners further refine or adjust the Lean-Agile partnership as necessary to facilitate effective and efficient processes. The person considered to fill this position should be self-starting, extremely organized, and capable of working independently as well as in a team environment. The successful candidate will be able to work on multiple requirements and work to flexible priorities. This person needs to be a strong advocate for change management and able to help the team adopt new technologies.<br>This person also would have some command of end-to-end testing for system development and the ability to provide a total system perspective including the technology understanding, dependencies and requirements. The candidate will use critical thinking, problem-solving, facilitation, and superior communication skills – written and oral –to interact with a wide variety of stakeholders.<br>Project responsibilities are listed below:<br>• Assist Sponsor Program Manager in the development of a seamless, end-to-end production and dissemination system.<br>• Participate in formal/informal reviews to determine quality, then develop or specify standards, methods, or procedures to determine product quality or release readiness.<br>• Serve as a key resource in the management and implementation of mission engagement activities to include facilitating technical exchange meetings between production subject matter experts (SMEs), business process analysts, end users, and developers. <br>• Reach key audiences for daily announcements and strategic messages for all Sponsor efforts, including frequent updates of website content so information is readily available for quick reference and educational purposes. <br>• Work independently and as part of a team to identify required functionality and efficient operating solutions for specific production workflows.<br>• Consult with and provide guidance to production SMEs to ensure coordination across project development teams, and Sponsor team members.<br>• Develop, assess, document and track program requirements.<br>• Compose technical documents, including user’s manuals and training guides.<br>• Communicate incidents, problems, and escalations to internal and external partners.",
            "sourceDate": "01/23/2019",
            "title": "Project Integrator"
        },
        {
            "desired": "1. Demonstrated experience providing Query Optimization guidance and development. <br>2. Demonstrated experience driving database related projects.<br>3. Demonstrated experience with Oracle Text and Oracle GoldenGate.<br>4. Demonstrated experience with Oracles Database Control. <br>5. Demonstrated experience with the Sponsor or Sponsor's partners and their processes.<br>6. Demonstrated implementation experience with Data Modeling concept (relational and dimensional) and tools such as Erwin. <br>7. Demonstrated experience with databases in virtualized environments.<br>8. Demonstrated experience with the Agile development methodology.<br>9. Demonstrated experience synching geographically dispersed databases.<br>10. Demonstrated experience with JAVA and J2EE",
            "dueDate": "02/07/2019",
            "id": "I 2019-29894",
            "location": "Reston",
            "mandatory": "1. Demonstrated Oracle database administration experience supporting a global application with 24x7 production environments.<br>2. Demonstrated experience installing, configuring, troubleshooting and maintaining recent versions of Oracle database instances, specifically RDS.<br>3. Demonstrated experience with database backend processes and engineering to include indexing, disk optimization and capacity planning.<br>4. Demonstrated experience with database replication technologies.<br>5. Demonstrated experience with Linux or UNIX.<br>6. Demonstrated experience with Oracle 11G, 12C and one or more of the following: Oracle RAC, SQL, RMAN, ASM or CRS.<br>7. Demonstrated experience ensuring availability of databases and proactive monitoring.<br>8. Demonstrated experience with security requirements for databases.<br>9. Demonstrated experience developing, documenting and implementing database backup and recovery processes and procedures.<br>10. Demonstrated experience creating and maintaining shell scripts and stored procedures.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Database Administrator category includes all levels of skills from supporting the mission critical, highly visible system with data input to very sophisticated DBA support of databases like Oracle. The duties may include any of the following: <br>• Review, develop, and design data models using standard diagramming techniques, in conjunction with application development teams.<br>• Create logical data models and translate into physical database structures that integrate with existing or proposed database structures.<br>• Monitor relational databases to optimize database performance, resource use, and physical implementations of databases; address a variety of database integration issues including migration between disparate databases, integration, maintenance/conversion, capacity planning issues, and new applications.<br>• Maintain development, test and production RDBMS environments. <br>• Monitor and maintain database security and database software, in cooperation with security personnel.<br>• Provide advice to applications programmers in the effective use of database languages; advise on troubleshooting, exception processing needs and other data management issues. <br>• Maintain availability and integrity of databases through multiple access schemes.<br>• Facilitate sharing of common data by overseeing proper key and index management and data dictionary maintenance.<br>• May evaluate and recommend testing and evaluation of new procedures, software, and hardware.<br>• Monitor and manage database backups, logs, and journals; install, maintain, and upgrade database software; restore and/or recover data as required. <br>• Create, procure and maintain various database related documents such as manuals and programmers handbooks.<br>• May provide 24-hour on-call support.<br>• Responsible for coordinating with various project teams to provide input during project design and development to ensure that the Sponsor produces quality products. <br>• Works with Senior Technologists to provide technical guidance to both Project Managers and other applications developers during the development process.<br>• Level 3 duties may include some data entry, as well as data analysis and the ability to run complex queries in databases.<br>• The DBA may maintain the GUIs, thus SQL and Oracle may be useful. <br>• The DBA will work with other teams to set up infrastructure for warehouses to perform business analytics.",
            "sourceDate": "01/25/2019",
            "title": "Database Administrator"
        },
        {
            "desired": "1. Demonstrated experience performing software design and application.<br>2. Demonstrated experience with JSON, XML and/or POJO’s.<br>3. Demonstrated experience conducting unit testing and documenting software modifications.<br>4. Demonstrated experience with deploying Software using DevOps deployment tools in the Sponsors environment.<br>5. Demonstrated experience with Amazon Web Services (Certifications a Plus).<br>6. Demonstrated experience with Test Driven Development and Continuous deployment with Continuous Integration tools (Describe which tools and methodologies have been used).<br>7. Demonstrated experience with a working knowledge of Linux variants (CentOS, Redhat etc.)<br>8. Demonstrated experience with HTTP Protocol and REST Complaint API’s (experience with HATEOAS or HAL is a plus).<br>8. Demonstrated experience with using x.509 PKI infrastructure in the Sponsors environment.",
            "dueDate": "02/07/2019",
            "id": "I 2019-29895",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience with software development in Java. <br> <br>2. Demonstrated experience working with DevOPS tools including GIT and Jenkins.<br>3. Demonstrated experience with Enterprise Java Development frameworks and tools, which include but are not limited to, Spring Boot and Hibernate.<br>4. Demonstrated experience working with a modern UI JavaScript Framework which can include, but is not limited to Angular, React, Vue and others.<br>5. Demonstrated experience utilizing JavaScript libraries including Bootstrap and JQuery.<br>6. Demonstrated experience participating in an agile development team.<br>7. Demonstrated experience with modern build tools such as Maven and Gradle.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is seeking a highly motivated individual to assist with the development, design and integration of a high profile enterprise registration system among other activities.  This individual should have a strong UI background.  This individual will join an existing engineering team while bringing exciting ideas into a rapid and Agile DEVOPS environment.<br>Responsibilities include:<br>• Developing detailed specifications inside an agile environment;<br>• Creating technical documentation and working from a story board;<br>• Designing solutions from both ground up as well while future-proofing the design;<br>• Managing and working within the code deployment process;<br>• Validating and testing code (including peer unit testing and review);<br>• Deployment and responsibility for health of the system<br>The Sponsor is seeking a strong software engineer with a well-rounded understanding of a variety of IT concepts and is comfortable learning, evolving and applying that broad knowledge on a daily basis. A candidate will work in an integrated test driven environment that is highly reliant on DevOPS, AWS and related emerging technologies. The candidate will be expected to provide independent working ability as well as utilizing paired programming techniques to construct resilient and creative solutions to answer the challenges of the system. Team members are expected to develop specifications and make recommendations on existing systems using new and emerging technologies to promote system stability for the Sponsor's partners.<br>Also, the candidate will be responsible for assisting with the daily operation and maintenance, which includes assisting with the extension, enhancement, refactoring, and architecture of the existing software and responding to a variety of ad hoc requests. This position will join an integrated project team and new team members will be expected to work closely with a variety of skill sets, such as Project Managers, System Engineers and Architects.",
            "sourceDate": "01/25/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience with cloud based technologies.<br>2. Demonstrated experience with IDM standards such as SAML2, OAUTH2 or JSON Web Tokens.<br>3. Demonstrated experience with DevOps components such as: GitHub, Jenkins, or Artifactory.<br>4. Demonstrated experience with agile development methodologies (e.g., sprint planning, sprint retrospectives, work backlog, user stories, acceptance criteria, story clarifications).<br>5. Demonstrated experience with data attribute validation, acquisition, management and re-purposing for use in policies and processes as the basis of secure solutions.<br>6. Demonstrated experience developing architectural and engineering patterns and maturity models.<br>7. Demonstrated experience with developing, drafting, and presenting program documentation (TEM materials, Concept of Operations, Implementation Plans) to communicate with stakeholders.<br>8. Demonstrated experience with large-scale or enterprise programs and networking of large scale DBMS and software services.",
            "dueDate": "02/08/2019",
            "id": "I 2019-29908",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience with J2EE design and Java development using an n-layered architecture to develop restful Web services.<br>2. Demonstrated experience with Web development using XML.<br>3. Demonstrated experience using Lightweight Directory Access Protocol (LDAP) services for authentication.<br>4. Demonstrated experience with Web development using Tomcat.<br>5. Demonstrated experience with Web development using the Spring Framework.<br>6. Demonstrated experience developing on a Linux platform.<br>7. Demonstrated experience with PKI certificate integration.<br>8. Demonstrated experience with enterprise level deployments, supporting implementations of authentication and authorization across multiple security domains (networks, enterprise, enclaves).<br>9. Demonstrated experience with providing ETL development and engineering services.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Customer is looking for an energetic, creative resource with excellent skills and a proven track record of success. This position is for a subject matter expert software engineer with deep, broad technical knowledge and experience with the Customer IT environment (architecture, applications, technologies, and infrastructure). The Candidate will work closely with customer’s Project Manager to support ETL activities the Authoritative Attribute business area. <br>The software engineer will work as part of an agile development team to design, develop, integrate, test, and deploy GOTS/COTS components focusing on ETL of attributes from disparate systems into the Authoritative Attribute LDAP store. The software engineer will participate in the development, maintenance and enhancement of the GOTS components and supervise installation, maintenance, and deployment of the COTS product, making configuration changes as needed. <br>Prior knowledge of authentication and authorization is helpful as is experience with cloud environments. The software engineer will interface with the infrastructure teams during deployments or troubleshooting. The successful candidate will work with new and existing customers to ensure authentication and identity propagation requirements are satisfied. The individual will provide ad hoc support to project-related activities as needed and tasked by management, and will work with project management to prioritize multiple customer stories and tasking when conflicts arise. This work requires significant interaction across many customers and groups and other Service Providers to understand requirements, assess enterprise capabilities that fulfill these needs, and ensure services are compliant with customer's governance.",
            "sourceDate": "01/28/2019",
            "title": "Software Engineer"
        },
        {
            "desired": "1. Demonstrated experience with mobile application development for Android using Android studio or iOS using Apple Xcode IDE.<br>2. Demonstrated experience developing robust J2EE, C#, VUE applications.<br>3. Demonstrated experience with other mobile application development tools such as PhoneGap or for Windows mobile environments.<br>4. Demonstrated experience with open source products and tools.<br>5. Demonstrated experience with Agile and full life-cycle software development.<br>6. Demonstrated experience translating requirements into end-to-end design for applications that involve multiple interfaces to other applications and supporting data repositories.<br>7. Demonstrated experience with building mobile apps for content aggregation.<br>8. Demonstrated experience exhibiting troubleshooting and debugging skills.",
            "dueDate": "02/07/2019",
            "id": "I 2019-29911",
            "location": "Herndon",
            "mandatory": "1. Demonstrated experience developing with HTML, CSS, Javascript, Node.JS and jQuery.<br>2. Demonstrated experience with two or more of the following tools or methods: Ant, Git, Subversion, Maven, test-driven development.<br>3. Demonstrated experience with REST services.<br>4. Demonstrated experience working in Agile teams.<br>5. Demonstrated experience working in AWS cloud services.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The chosen candidate will be part of the Sponsor’s development team using Java/J2EE, UNIX/Linux, Apache, and cross platform mobile app development technologies. The team works in a fast paced collaborative and agile environment, following Scrum/Kanban methodologies. This is a small team working within an environment with multiple large, high-energy, high-performing teams in which developers frequently share thoughts and skills. The right candidate will have the opportunity to focus on building systems that support applications to be delivered on multiple end point devices, including tablets, desktops/laptops, and potentially, smart phones.<br>The candidate will be involved in all aspects of the software development lifecycle. The candidate will be expected to assist with architecture, design and development, user experience development, documentation, unit testing, delivery and maintenance. The successful candidate will be interfacing with partner teams to provide common services, device agnostic apps, and libraries. The candidate will be participating in code reviews and code analysis, as well as be expected to deliver top quality products. This will include being expected to identify and fix any defects as part of quality assurance. The successful candidate will work directly with the customers and end users to design and implement solutions for pushing internal enterprise applications out to mobile devices. The team works in an informal environment where constant change is the norm and the bar for quality is set high.",
            "sourceDate": "01/25/2019",
            "title": "Applications Developer"
        },
        {
            "desired": "1. Demonstrated experience and ability to assess project problems and provide recommendation for resolution. <br>2. Demonstrated experience and ability to create programmatic documentation based on PMF guidelines.<br>3. Demonstrated experience with PL/SQL and Oracle databases.<br>4. Demonstrated experience or knowledge of Service Oriented Architecture (SOA) and Single Object Access Protocol (SOAP) or Representational State Transfer (REST) web services used to implement SOA patterns.",
            "dueDate": "02/07/2019",
            "id": "I 2019-29912",
            "location": "Springfield",
            "mandatory": "1. Demonstrated experience evaluating technical requirements and designs to identify technical and programmatic risks and provide recommendations to address those risks.<br>2. Demonstrated experience and ability to translate customer requirements into system requirements for custom software application aligned with the enterprise architecture.<br>3. Demonstrated experience and knowledge of software development project life cycles, such as agile and waterfall.<br>4. Demonstrated experience with custom developed java software applications.<br>5. Demonstrated experience with project planning, control gate documentation, tracking progress against project plans/schedules as well as creating and executing risk management strategies.<br>6. Demonstrated experience analyzing and developing business processes based on technical requirements, to include process map designs, business process re-engineering, and business transformation activities.<br>7. Demonstrated experience developing system architectures for large enterprise level software systems.<br>8. Demonstrated experience with project and design documentation (project plans, system Requirements documents, and interface control documents).",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Project is committed to transforming the management of logistic services. The primary goal of the team is to improve the Supply Chain Management and alignment of logistic services with customer needs and providing management with corporate insight to all logistic support operations. The SE will be responsible for as a working member of the team to identify, analyze, and define logistics and IT needs. As well as analyzing customers’ needs to determine functional requirements ensuring that, the technical solutions are consistent with the enterprise technical architecture. The SE will be expected to formulate and define the logistic services technical designs, based on the enterprise technical architecture. The SE will be expected to identify architectural, technology, processes, user risks, and potential impacts. The SE will be expected to provide a total systems perspective including a technical understanding of relationships, dependencies and requirements of the software and hardware components of the IT projects. The Program seeks programmatic assistance from individuals who are creative and team players, who have demonstrated experience supporting high quality IT products and experience with business transformation activities.",
            "sourceDate": "01/25/2019",
            "title": "Systems Engineer"
        },
        {
            "desired": "1. Demonstrated experience with source control and versioning tools such as SVN and Git.<br>2. Demonstrated experience with Windows system administration.<br>3. Demonstrated experience with the Sponsor’s applications and information security policies and practices.<br>4. Information Security Certificate for Systems Administrators (ICSA).<br>5. Certified Scrum Master (CSM).<br>6. AWS Certified Architect.",
            "dueDate": "02/08/2019",
            "id": "I 2019-29915",
            "location": "Bethesda",
            "mandatory": "1. Demonstrated experience in the software development lifecycle, to include requirements management, system design, software development, and release planning with demonstrated experience leading development teams.<br>2. Demonstrated experience in website production and publishing environments.<br>3. Demonstrated experience developing applications using ASP.NET and .NET/C# including ancillary technologies such as Entity Framework and LINQ.<br>4. Demonstrated experience with HTML, CSS and JavaScript.<br>5. Demonstrated experience designing and developing databases using Relational Database Management Systems (RDBMS) (e.g. MS SQL Server and MySQL).<br>6. Demonstrated experience with cloud computing technologies such as AWS.<br>7. Demonstrated experience diagnosing undefined issues and devising resolution strategies for complex technical problems in a collaborative team environment.<br>8. Demonstrated experience creating technical documents, leading technical meetings in a scrum and technical exchange meeting (TEM), and providing technical briefs to senior management.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is seeking a Web Developer to join their team.  The position also involves refresh opportunities for existing solutions, either to update applications to current baseline or leverage existing solutions to increase capabilities.<br>Duties:<br>1. Assess program office web-based requirements and propose technical solutions to fill the gap.<br>2. Ensure all web-based solutions are compliant with various oversight authorities such as Public Affairs, Civil Liberties, System Security General Counsel, etc. (including Section 508 compliance).<br>3. Provide software-programming support for web-based solutions and may be required to provide training to the end-user groups on those solutions.<br>The Sponsor is continually searching for ways to improve our processes and provide better services to our customers.  The Web Developer is expected to provide insight into better ways of doing business and support us in the effort.",
            "sourceDate": "01/28/2019",
            "title": "Web Developer"
        },
        {
            "desired": "1. Demonstrated ability to monitor the progress of multiple concurrent and highly visible projects and requirements with the ability to recommend or take required corrective actions<br>skilled at risk identification and management<br>and communicate effectively to the customer, stakeholder, and project team.<br>2. Demonstrated knowledge and experience with leading and managing enterprise level projects that has a multi-disciplinary cross-organizational project teams from start to end using the Sponsors Project Management Framework (PMF) and Agile Project Management methodology.<br>3. Demonstrated knowledge and experience with managing multiple concurrent projects, short deadlines, and competing priorities.<br>4. Demonstrated knowledge and experience to identify programmatic challenges, risks, and constraints coupled with strong ability to convey well thought mitigation strategies.<br>5. Demonstrated knowledge and experience to lead and manage infrastructure engineering projects using the Agile methodology and ability to recognize challenges and make recommendation for necessary changes needed to help projects successful operating within the Agile construct.<br>6. Demonstrated outstanding interpersonal communication skills when communicating with both technical staff and non-technical customers.<br>7. Demonstrated outstanding oral and written communication skills.",
            "dueDate": "02/11/2019",
            "id": "I 2019-29921",
            "location": "Chantilly",
            "mandatory": "1. Demonstrated experience and knowledge of the Requirements Management process.<br>2. Demonstrated experience and ability to prepare formal requirements documentation.<br>3. Demonstrated experience and ability provide technical review and validation of requirements.<br>4. Demonstrated experience and knowledge with full software development life cycle.<br>5. Demonstrated experience and ability to establish relationships with customers and partners and collaborate with service providers and developers to understand and anticipate requirements.<br>6. Demonstrated experience with agile and test driven development processes.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The customer has an immediate need for a Requirements Specialist to work with sponsor’s partners to provide in-depth requirement analysis, drafting and receiving approval for new requirements and may include final technical review and validation of requirements. Work includes overseeing requirements tracking, and collaborating with team, customers and service providers to identify requirements and changes that will fulfill the customer's need. These positions will stay abreast of new opportunities to implement customer-required changes.",
            "sourceDate": "01/29/2019",
            "title": "Requirements Specialist"
        },
        {
            "desired": "1. Experience working with a variety of database technologies such as Oracle, MySQL, PostgreSQL, SQL Server.<br>2. Understanding use of containers in the cloud.<br>3. Familiarity with cloud orchestration tools.<br>4. Additional AWS services: Glacier, CloudWatch, CloudTrail, SQS, SWF, IAM.<br>5. Experience and knowledge working and managing tasks in sprint cycles, participating in sprint grooming and planning sessions.<br>6. Ability to quickly learn new technologies, instill concepts and effectively communicate benefits to management and customers.<br>7. Experience or knowledge of Data Visualization tools.",
            "dueDate": "02/08/2019",
            "id": "I 2019-29922",
            "location": "Reston",
            "mandatory": "1. Demonstrated experience in System administration of both Linux and Windows systems with adherence to security best practices and access control policies.<br>2. Experience in integrating new applications and technologies into an existing system.<br>3. Strong analytic skills with the ability to resolve issues associated with system configuration management, resource sharing and networking concepts.<br>4. Demonstrated experience in Configuration Management.<br>5. Demonstrated experience with Cloud Technologies creating, configuring and managing AWS components including EC2, RDS, VPC, S3.<br>6. Familiarity with web technologies including HTML and JavaScript and ability to write scripts in PowerShell, Bash or similar languages.<br>7. Experience or familiarity with DevOps tools such as JIRA, GitHub, and Jenkins.<br>8. Ability to clearly and concisely write and deliver high-quality technical documents.<br>9. Ability to communicate in non-technical terms to non-technical people, isolating and resolving customer problems.",
            "reportDate": "Jan 29 2019",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "The Sponsor is requesting a System Engineer who will work to integrate and customize COTS, Sponsor’s and legacy custom SW capabilities and architecture improvements in the program. An ideal candidate would be a Systems Engineer with systems administration skills in a cloud environment. Work will be performed with small project teams that are responsible for all aspects of the development and maintenance lifecycle.<br>Responsibilities include but not limited to:<br>Systems Administration, Cloud technologies, Programming capability, DevOps tools, Communications and Customer Interaction.",
            "sourceDate": "01/28/2019",
            "title": "Systems Engineer"
        }
    ],
    "timestamp": "Monday 02/04/19 10:44:35"
}