{
    "jobs": [
        {
            "daysVacant": 29,
            "id": "TTG 133",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Customer seeks an Applications Developer to support the development of web app APIs for current tools.  The office is a RAILS office so Ruby and Rails are vital to developer’s success.<br>Required skills/experience: Demonstrated on-the job experience with full life-cycle application software development, Demonstrated on-the job experience building APIs or microservices as well as writing tests.<br>Required Certifications: N/A<br>Desired skills/experience: Demonstrated on-the job experience with the Sponsor’s development platform (RAILS is the preferred technology)<br>Desired Certifications: N/A",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Hours: Core<br>Description: Customer seeks an Applications Developer to support the development of web app APIs for current tools.  The office is a RAILS office so Ruby and Rails are vital to developer’s success.<br>Description: The applications developed aid analysts in solving complex analytical problems.  This is a unique opportunity for a developer to design and develop mission applications and lead small projects.  The candidate would have the opportunity to develop applications with varying degrees of scale, risk, and complexity.  Developer duties may include serving as the technical lead for the design, testing, and implementation of complex applications, complex web application layouts, content and user interfaces and/or database projects.<br>Mandatory Skills:<br>-\tDemonstrated on-the job experience with full life-cycle application software development with specialized experience to include hands on involvement in all aspects of the applications software development life-cycle (requirements analysis, design, programming, testing, and deployment as well as troubleshooting).<br>-\tDemonstrated on-the job experience building APIs or microservices as well as writing tests.<br>-\tDemonstrated on-the job experience with JSON as it is the encoding of choice for the majority of APIs published.<br>-\tExperience with Authentication protocols (i.e. mutual auth, basic auth, oAuth).<br>-\tKnowledge of common web service protocols (such as HTTP, REST) including understanding the architectural style and all its permutations.<br>-\tApplication development using a scripting language such as Python, NodeJS, etc.<br>-\tExperience with Agile production development methodologies, working on a Scrum Team.<br>-\tStrong experience in building, configuration and administration of APIs.  Experience in integrating, diagnosing and debugging complex systems. <br>-\tExperience with Windows and Linux Operating systems and Command Line Tools (Power Shell, Cron).<br>Desired Skills:<br>-\tDemonstrated on-the job experience exhibiting customer service skills.<br>-\tDemonstrated on-the job experience working in a team environment exhibiting problem solving skills.<br>-\tDemonstrated on-the job experience with the Sponsor’s development platform (RAILS is the preferred technology).<br>-\tDemonstrated on-the job experience with the Sponsor’s partners and their current technology issues.<br>-\tDemonstrated on-the job experience exhibiting written skills to include technical documentation.<br>-\tDemonstrated experience deploying applications to a cloud infrastructure using AWS.<br>-\tDemonstrated experience in AI/ML API development.<br>Responsibilities include, but are not limited to:<br>-\tThe developer consults with clients to develop complex API requirements.<br>-\tTranslates user requirements from a formal requirement document into an API or Micro-Service.<br>-\tBuilds and maintains APIs using Micro-Service architecture ensuring interoperability with other applications.<br>-\tDesigns APIs addressing how they are used, how they scale, how they fit together and how they break.<br>-\tInfluence design and configure API policies, governance and access.<br>-\tWork closely with other developers to ensure that solutions are designed with customer user experience, security, scale/performance and operability in mind.",
            "title": "Applications Developer"
        },
        {
            "daysVacant": 24,
            "id": "TTG 134",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Customer has an immediate need for an Information System Security Engineer (ISSE) to be part of the engineering division.\tThis is a fairy small group that support about ten critical systems that contain very sensitive data. <br>Required Skills:<br>• Demonstrated on-the--job knowledge and experience with Information Assurance/Cyber Engineering requirements, design and implementation to include systems engineering principles, requirements analysis, system development (software and hardware), network security architecture concepts (topology, protocols, components), and/or IT security principles and methods (firewalls, demilitarized zones, encryption).<br>• Demonstrated on-the-job knowledge and experience with developing and reviewing security concept of operations, systems security plans, security control assessments, contingency plans, configuration management plans, incident response plans, plan of actions and milestones, risk management plans, vulnerability scanning, and/or vulnerability management plans.<br>• Demonstrated on-the-job knowledge and experience cloud security design, requirements analysis, control implementation, and mitigation.<br>• Demonstrated on-the-job knowledge and experience with ICD-503, FISMA and RMF/A&A processes, NIST SP (800-27, 30, 37, 53, 60, 137, 144, 145), FIPS (199, 200), and CNSSI 1253 technical controls and developing and maintaining associated certification and accreditation documentation.<br>• Demonstrated on-the-job knowledge and experience in security systems engineering that involves various computer hardware and software operating system and application solutions in both stand-alone and LAN/WAN configurations.<br>• Demonstrated on-the-job knowledge and experience with security features and/or vulnerability of various operating systems (ie Window Server, Windows clients, Microsoft Exchange, Red Hat Enterprise Linux,CentOS) and CISCO systems.<br>• Demonstrated on-the-job knowledge and experience with performing security system scans for network, platform, database, and web services using different security tools (e.g. Nessus, Weblnspect, AppDetective).<br>• Demonstrated on-the-job knowledge and experience with performing security system scans for network,platform, database, and web services using different security with IA vulnerability testing and related network and system test tools; e.g., Retina, NMap, ACAS, EVSS, HBSS, Nessus, Security Content Automation Protocol (SCAP).<br>• Demonstrated on-the-job knowledge and experience with cyber security toolset including anti-virus,Vulnerability Assessment, HIDS and NIDS.<br>• Demonstrated on-the-job knowledge and experience with various technologies and vendors for network (e.g. Cisco, Juniper), platforms (e.g. Microsoft Windows, Linux Redhat/CentOS), database (e.g. Oracle, MySQ L, SQL server), and web services (e.g. ISS, Apache, Tomcat, Passenger).<br>Desired Skills:<br>• Demonstrated outstanding interpersonal skills and team player<br>• Demonstrated outstanding written and verbal communication skills; ability to present reports to management; motivated to thoroughly investigate, analyze, and document system issues and resolutions<br>• Demonstrated outstanding ability to produce quality deliverables and to complete assigned projects on time, provide consistent status updates to ensure IT security projects stay focused.<br>• Demonstrated outstanding attention to detail - completes tasks per standard operating procedures; reports discovered anomalies and inconsistencies<br>• Demonstrated outstanding persistent and creative problem solver - strong troubleshooting skills and determined to find solutions to technical problems; identifies root cause and presents possible solutions to management<br>• Demonstrated outstanding work ethic and a proven professional - respectful, dependable, takes initiative and follows through, dedicated to excellence and getting the job done",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Customer has an immediate need for an Information System Security Engineer (ISSE) to be part of the engineering division.\tThis is a fairy small group that support about ten critical systems that contain very sensitive data. <br>Required Skills:<br>•\tDemonstrated on-the--job knowledge and experience with Information Assurance/Cyber Engineering requirements, design and implementation to include systems engineering principles, requirements analysis, system development (software and hardware), network security architecture concepts (topology, protocols, components), and/or IT security principles and methods (firewalls, demilitarized zones, encryption).<br>•\tDemonstrated on-the-job knowledge and experience with developing and reviewing security concept of operations, systems security plans, security control assessments, contingency plans, configuration management plans, incident response plans, plan of actions and milestones, risk management plans, vulnerability scanning, and/or vulnerability management plans.<br>•\tDemonstrated on-the-job knowledge and experience cloud security design, requirements analysis, control implementation, and mitigation.<br>•\tDemonstrated on-the-job knowledge and experience with ICD-503, FISMA and RMF/A&A processes, NIST SP (800-27, 30, 37, 53, 60, 137, 144, 145), FIPS (199, 200), and CNSSI 1253 technical controls and developing and maintaining associated certification and accreditation documentation.<br>•\tDemonstrated on-the-job knowledge and experience in security systems engineering that involves various computer hardware and software operating system and application solutions in both stand-alone and LAN/WAN configurations.<br>•\tDemonstrated on-the-job knowledge and experience with security features and/or vulnerability of various operating systems (ie Window Server, Windows clients, Microsoft Exchange, Red Hat Enterprise Linux,CentOS) and CISCO systems.<br>•\tDemonstrated on-the-job knowledge and experience with performing security system scans for network, platform, database, and web services using different security tools (e.g. Nessus, Weblnspect, AppDetective).<br>•\tDemonstrated on-the-job knowledge and experience with performing security system scans for network,platform, database, and web services using different security with IA vulnerability testing and related network and system test tools; e.g., Retina, NMap, ACAS, EVSS, HBSS, Nessus, Security Content Automation Protocol (SCAP).<br>•\tDemonstrated on-the-job knowledge and experience with cyber security toolset including anti-virus,Vulnerability Assessment, HIDS and NIDS.<br>•\tDemonstrated on-the-job knowledge and experience with various technologies and vendors for network (e.g. Cisco, Juniper), platforms (e.g. Microsoft Windows, Linux Redhat/CentOS), database (e.g. Oracle, MySQ L, SQL server), and web services (e.g. ISS, Apache, Tomcat, Passenger).<br>Desired Skills:<br>•\tDemonstrated outstanding interpersonal skills and team player<br>•\tDemonstrated outstanding written and verbal communication skills; ability to present reports to management; motivated to thoroughly investigate, analyze, and document system issues and resolutions<br>•\tDemonstrated outstanding ability to produce quality deliverables and to complete assigned projects on time, provide consistent status updates to ensure IT security projects stay focused.<br>•\tDemonstrated outstanding attention to detail - completes tasks per standard operating procedures; reports discovered anomalies and inconsistencies<br>•\tDemonstrated outstanding persistent and creative problem solver - strong troubleshooting skills and determined to find solutions to technical problems; identifies root cause and presents possible solutions to management<br>•\tDemonstrated outstanding work ethic and a proven professional - respectful, dependable, takes initiative and follows through, dedicated to excellence and getting the job done<br>The successful candidate is expected to perform the following duties:<br>As the ISSE, the candidate shall:<br>•\tEngineer, design, implement, and test network intrusion detection system (IDS), network intrusion protection system (IPS), host intrusion protection system (HIPS), web and application protection, enterprise anti-virus suite to protect the following IT components: network, storage, computing, databases, web services and application;<br>•\tISSE will work closely with the architects, engineers, and developers in the identification and implementation of appropriate information security functionality to ensure uniform application of security policy and enterprise solutions;<br>o\tenforce the design and implementation of trusted relations among external systems and architectures<br>o\tassess and mitigate system security threats/risks throughout the program life cycle<br>o\tcontribute to the security planning, assessment, risk analysis, risk management, certification and awareness activities for system and networking operations;<br>o\treview certification and accreditation (C&A) documentation, provide feedback on completeness and compliance of its content;<br>o\tapply system security engineering expertise in one or more of the following to: system security design process; engineering life cycle; information domain; cross domain solutions; commercial off-the-shelf and government off-the-shelf cryptography; identification; authentication; and authorization; system integration; risk management; intrusion detection; contingency planning; incident handling; configuration control; change management; auditing; certification and accreditation process; principles of IA (confidentiality, integrity, non­ repudiation, availability, and access control); and security testing;<br>•\tAble to provide security requirements to architects, engineers and developers.<br>•\tVerify systems implementation and provide mitigation recommendations to facilitate secure systems for A&A and Continuous Monitoring support.<br>•\tServe as the security subject matter expert for the A&A and Continuous Monitoring processes.<br>•\tProvide guidance to the System Owners and Teams and recommending implementation strategies.",
            "title": "Chief Cyber Security Engineer/Architect"
        },
        {
            "daysVacant": 72,
            "id": "TTG 135",
            "level": "Full Performance",
            "location": "Tyson's",
            "qualifications": "Active Directory, Windows 200x, Microsoft Exchange200x, Oracle10G & 11G.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "•\t(Location:Tyson) Thorough understanding of Active Directory Services & Interfaces (ADS)<br>•\t Highly knowledgeable with applications that can access LDAP, NDS, and other directories ADSI interfaces. <br>•\tHighly knowledgeable with Windows 200x, Microsoft Exchange200x, Oracle10G & 11G. <br>•\tKnowledgeable in computer and network security concepts, techniques and systems. <br>•\tKnowledgeable in network components and interfaces. <br>•\tKnowledgeable of cloud operations. <br>•\tAbility to resolve and/or troubleshoot system problems while complying with Sponsors policies and procedures.<br>•\t Keep abreast of current development and trends in relative areas of technology. <br>•\tProduces professional documentations for standards, policies, and procedures. <br>•\tAbility to articulate complex technical architectures to a non technical audience. <br>•\tBe flexible in an environment that is consistently changing to meet the needs of the sponsor. <br>•\tPerform O&M services in COMSEC operational system to support ad-hoc customer requirements, duties include but not limited to maintenance and support for LMD/KP. <br>•\tSubsystems, Maintenance and support for the MGC and AKP, maintain connectivity to Central Facility, perform KP re-initialization, support re-certification, perform LMD/KPEKMS COMSEC account site initialization.<br>•\t Perform phase 5 platform conversion, update virus definitions, apply operating  systems patches as required and perform daily backups. <br>•\tWorking knowledge with Unix/Linux operating systems.",
            "title": "Computer Engineer"
        },
        {
            "daysVacant": 29,
            "id": "TTG 136",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Demonstrated experience required to include considerable knowledge of the customer's operational environment to include: desktop hardware, software, peripheals, web technologies, security guidelines, operating systems, VTC, network/systems for integration and installation.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "daysVacant": 109,
            "id": "TTG 137",
            "level": "Senior",
            "location": "Reston",
            "qualifications": "Candidate responsible for providing timely and dependable first tier, unclassified, desktop and access administration support customers. Candidate responsible for providing timely and dependable first tier, unclassified, desktop and access administration support customers<br>•\tMotivated IT professional supporting customers in person, via telephone or ESMT.<br>•\tAbility to receive, coordinate, analyze, track and resolve multiple customer requests. This includes hardware and software, diagnosing and resolving computer-related issues, coordinating customer requirements within the existing network team, assisting with the implementation of hardware/software upgrades and deliveries and reporting unresolved problems to appropriate technical personnel via ESMT.<br>•\tOvertime may be required to accomplish mission tasks.<br>•\tCandidate must remain flexible/adaptable to schedule, work location and workload variations as depicted by customer.<br>•\tCMA (Component Mission Administrator) access not required but beneficial to have.<br>•\tWorking knowledge of updating, patching and imaging workstations is required.<br>•\tExcellent customer service consulting and desktop diagnostic skills required.<br>Location: Reston, VA, potential need to support customers in McLean, VA on occasion. Hours are 8:00-4:30.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "•\tMotivated IT professional supporting customers in person, via telephone or ESMT.<br>•\tAbility to receive, coordinate, analyze, track and resolve multiple customer requests. This includes hardware and software, diagnosing and resolving computer-related issues, coordinating customer requirements within the existing network team, assisting with the implementation of hardware/software upgrades and deliveries and reporting unresolved problems to appropriate technical personnel via ESMT.<br>•\tOvertime may be required to accomplish mission tasks.<br>•\tCandidate must remain flexible/adaptable to schedule, work location and workload variations as depicted by customer.<br>•\tCMA (Component Mission Administrator) access not required but beneficial to have.<br>•\tWorking knowledge of updating, patching and imaging workstations is required.<br>•\tExcellent customer service consulting and desktop diagnostic skills required.",
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "daysVacant": 24,
            "id": "TTG 138",
            "level": "Expert",
            "location": "McLean",
            "qualifications": "Laptop experience, Hardware/Application Troubleshooting required; Candidate must possess excellent Customer Service skills (proactive, good communicator, responsive to customer needs). Demonstrated experience with Active Directory, Windows 10, Microsoft Outlook, and Microsoft Office Suite.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "daysVacant": 50,
            "id": "TTG 139",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Ops Admin",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Additional Mandatory Skills: <br>• Associate Degree or Bachelor's degree in Computer Science, System Engineering or related field<br>• 1-2 years directly related work experience in a technical help desk position supporting Windows XP, Microsoft Office 2003 or later, Internet Explorer, and business applications used within a business environment<br>• Knowledge of multiple desktop programs, configuration and debugging techniques<br>• Detailed oriented as well as excellent oral and written communication skills<br>• Sound problem resolution, judgment, and decision-making<br>• Experience with TCP/IP and general networking issues<br>• Experience providing superior customer service and support<br>• Experience working effectively in a team environment, communicating effectively, resolving issues efficiently, and contributing to the improvement of the infrastructure<br>• Strong interpersonal and organization skills, successful in working both independently and in a team environment<br>• Strong troubleshooting skills<br>• Experience excellent listening and writing skills<br>Desired Skills: <br>• Help Desk/O&M experience<br>• Ability to work independently; and manage multiple task assignments<br>• Excellent verbal and written communication skills<br>• Demonstrated experience with Service Now or IBM Tivoli Service Request Manager<br>• Demonstrated experience with monitoring tools and creating metric reports<br>• Demonstrated ability to describe how to use an application, system, etc.<br>• Experience with data mining tools (i.e., Splunk)<br>• Experience with monitoring tools (i.e., Nagios)",
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "daysVacant": 17,
            "id": "TTG 140",
            "level": "Full Performance",
            "location": "Tyson's",
            "qualifications": "Hours: Monday-Friday 9:30-6:00pm<br>Required Skills/Experience: Tier 2 hardware, software and network troubleshooting, Excellent customer service<br>Required Certifications: N/A<br>Desired Skills/Experience: N/A<br>Desired Certifications: N/A",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Hours: Monday-Friday 9:30-6:00pm<br>Required Skills/Experience: Tier 2 hardware, software and network troubleshooting, Excellent customer service<br>Required Certifications: N/A<br>Desired Skills/Experience: N/A<br>Desired Certifications: N/A",
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "daysVacant": 140,
            "id": "TTG 141",
            "level": "Senior",
            "location": "Fort Meade, MD",
            "qualifications": "Hours: Core hours 7:30am – 4pm <br>Required skills/experience: Windows System Administrator, PKI<br>Required Certifications: None <br>Desired skills/experience: <br>-Comsec<br>-System Accreditation<br>Desired Certifications: <br>-Microsoft Certified Solutions Expert (MCSE)<br>-Microsoft Certified Solutions Associate (MCSA)<br>Currently Required - May change after 2/14 meeting:<br>• Working knowledge of Windows Server 2003, 2008 and 2012<br>• System hardening and patching<br>• Experience with Cisco ASA 5510<br>• Experience with Site to Site VPN on firewalls<br>• Updating group policies<br>• Understanding of SNMP and IAVA patches<br>• Working knowledge of Visio to create cable and network diagrams<br>• Maintain and update SOP’s and SSP for system accreditation<br>• Understanding of Oracle 10g<br>Senior Microsoft Windows System Administrator; Working knowledge of Windows Server 2003, 2008 and 2012; Working knowledge of PKI certifications; Cisco ASA 5510 experience; Updating Group policies; Understanding of Oracle 10G; Working knowledge of ComSec, encryption devices, and electronic keys; Working knowledge of Visio to maintain and create new cable and network diagrams; Maintain/update SOP's and SSP's for system accreditation.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Hours: Core hours 7:30am – 4pm <br>Required skills/experience: Windows System Administrator, PKI<br>Required Certifications: None <br>Desired skills/experience: <br>-Comsec<br>-System Accreditation<br>Desired Certifications: <br>-Microsoft Certified Solutions Expert (MCSE)<br>-Microsoft Certified Solutions Associate (MCSA)<br>Currently Required - May change after 2/14 meeting:<br>• Working knowledge of Windows Server 2003, 2008 and 2012<br>• System hardening and patching<br>• Experience with Cisco ASA 5510<br>• Experience with Site to Site VPN on firewalls<br>• Updating group policies<br>• Understanding of SNMP and IAVA patches<br>• Working knowledge of Visio to create cable and network diagrams<br>• Maintain and update SOP’s and SSP for system accreditation<br>• Understanding of Oracle 10g<br>Senior Microsoft Windows System Administrator; Working knowledge of Windows Server 2003, 2008 and 2012; Working knowledge of PKI certifications; Cisco ASA 5510 experience; Updating Group policies; Understanding of Oracle 10G; Working knowledge of ComSec, encryption devices, and electronic keys; Working knowledge of Visio to maintain and create new cable and network diagrams; Maintain/update SOP's and SSP's for system accreditation.",
            "title": "Customer Services and Information Technology Officer"
        },
        {
            "daysVacant": 10,
            "id": "TTG 142",
            "level": "Expert",
            "location": "McLean",
            "qualifications": "Work summary: Candidate will assist with CI investigative efforts, conduct network traffic analysis, support CI focused network architecture reviews, and assess data pertaining to network intrusions and/or cyber related attacks on customer equities.  Also responsible for analyzing of data on Operational Technologies to minimize risks.  The Cyber Security Analyst Expert will serve as a representative of the Sponsor's Technical Director (TD) Staff. In this capacity, the candidate will analyze, investigate and provide in-depth synopses of Sponsor and various external customer projects and technical initiatives from all disciplines, leveraging the TD and TD Staff to the fullest extent possible.  Additional activities include evaluating technical security and risk assessments, drafting reports and memorandums for senior officers; attending customer meetings, and participating in all Sponsor activities related to the assignment.  <br>Required skills:<br>* CI experience<br>* Demonstrated understanding of sponsor's Operational Technologies<br>* Demonstrated experience in Certification and Accreditation (C&A), risk assessment methodologies, information security responsibilities for management, internet security, portable electronic devices vulnerabilities, thread analysis concerns.<br>* Demonstrated experience with commercial databases<br>* Demonstrated experience conducting research and producing professional writings<br>* Demonstrated experience analyzing complex data-sets<br>* Demonstrated experience producing executive briefs and analytical products<br>* Knowledge of encryption products, methodologies, configuration<br>* Knowledge of network packet capture appliances/applications, such as NetWitness, Solera, Probe, WireShark, Snort<br>* Knowledge of network vulnerability scanner, web scanner, and database scanner such as Nessus, WebInspect, AppDetective<br>Desired skills:<br>*Demonstrated experience communicating technical issues and vulnerabilities in simple terms to Executive Leadership at all levels as a technical writer.<br>* Graduate degree in Information Technology, Information Security, Cyber Security, or related field<br>* Demonstrated experience verifying/validating customer requirements, analyzing processes and job tasks and developing process improvement<br>Five plus years in network/cyber security experience in a secure environment.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Cyber Security Analyst"
        },
        {
            "daysVacant": 25,
            "id": "TTG 143",
            "level": "Senior",
            "qualifications": "Work summary: Customer is seeking a candidate with Network Engineering CI-centric experience and skills. The analyst will support the customer's overall CI threat analysis efforts by performing technical assessments on IT infrastructure components, malicious code, and Advance Persistent Threat capabilities as they relate to computer networking. The candidate will be expect to conduct IT network forensic assessments across a full spectrum of computer and network devices, Windows/Linux hosts, mobile devices, virtual machines, and software and hardware, to determine potential weaknesses and vulnerabilities that may affect the confidentiality, integrity, and availability of corporate protected and sensitive information systems and data. <br>Required skills: <br>* Must have a current Encase certification<br>* Experience with mobile OS, Android, iOS<br>* Candidate must have a proven ability to perform complete digital forensic analysis from acquisition to report with minimal assistance<br>* Candidate must have a demonstrated technical aptitude such as a computer science degree or a previous position in a computer related field with a minimum 5 year work experience<br>* Minimum three years experience examining any of the following media types: cell phones, hard drives, thumb drives, flash media, compact discs, etc.<br>* Candidate must have proven ability to create detailed technical reports and communicate highly technical information to a wide range of non-technical individuals<br>* Experience with any of the standard commercial forensic tools including FTK, Paraben, Helix, Ilook, Xways, WireShark, FireEye<br>* Experience with Macintosh OS<br>* Programming experience with Java, C, C++, Perl, Python, Enscripts<br>* Experience with Linux/Unix<br>* Familiarity with computer networks, information security systems and associated technologies<br>Desired skills:<br>* 2 years working in the IC<br>* Certifications: MCSE, MCITP, PMP<br>Bachelors degree in CS, Engineering or a related technical discipline, or the equivalent combination of education, technical certifications or training, or work experience. Ten plus years of network/system engineering experience in a secure environment and five plus years supporting mission based IP networks",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Cyber Security Forensic Specialist"
        },
        {
            "daysVacant": 25,
            "id": "TTG 144",
            "level": "Senior",
            "qualifications": "Work summary: Customer is seeking a candidate with Network Engineering CI-centric experience and skills.  The analyst will support the customer's overall CI threat analysis efforts by performing technical assessments on IT infrastructure components, malicious code, and Advance Persistent Threat capabilities as they relate to computer networking.  The candidate will be expect to conduct IT network forensic assessments across a full spectrum of computer and network devices, Windows/Linux hosts, mobile devices, virtual machines, and software and hardware, to determine potential weaknesses and vulnerabilities that may affect the confidentiality, integrity, and availability of corporate protected and sensitive information systems and data.  <br>Required skills: <br>* Must have a current Encase certification<br>* Experience with mobile OS, Android, iOS<br>* Candidate must have a proven ability to perform complete digital forensic analysis from acquisition to report with minimal assistance<br>* Candidate must have a demonstrated technical aptitude such as a computer science degree or a previous position in a computer related field with a minimum 5 year work experience<br>* Minimum three years experience examining any of the following media types: cell phones, hard drives, thumb drives, flash media, compact discs, etc.<br>* Candidate must have proven ability to create detailed technical reports and communicate highly technical information to a wide range of non-technical individuals<br>* Experience with any of the standard commercial forensic tools including FTK, Paraben, Helix, Ilook, Xways, WireShark, FireEye<br>* Experience with Macintosh OS<br>* Programming experience with Java, C, C++, Perl, Python, Enscripts<br>* Experience with Linux/Unix<br>* Familiarity with computer networks, information security systems and associated technologies<br>Desired skills:<br>* 2 years working in the IC<br>* Certifications: MCSE, MCITP, PMP<br>Bachelors degree in CS, Engineering or a related technical discipline, or the equivalent combination of education, technical certifications or training, or work experience.  Ten plus years of network/system engineering experience in a secure environment and five plus years supporting mission based IP networks",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Cyber Security Forensic Specialist"
        },
        {
            "daysVacant": 21,
            "id": "TTG 145",
            "level": "Senior",
            "location": "McLean",
            "qualifications": "This position is for a Data Scientist.<br>Hours: Core, Flexible<br>Required skills/experience:  Data analysis, construct complex queries, analytic methods, methodological tools, software development, identify gaps, research design for data collection, refine large data sets, assess quantitative data, data mining, statistical and mathematical modeling, scenario/alternative analysis, machine learning, advanced analytic techniques<br>Required certifications: N/A<br>Desired skills/experience: Software development, developing and documenting custom algorithms in response to customer requirements, SQL, R, Python<br>Desired certifications: N/A",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "This position requires an extra scrub.<br>Hours: Core, Flexible<br>Required skills/experience:  Data analysis, construct complex queries, analytic methods, methodological tools, software development, identify gaps, research design for data collection, refine large data sets, assess quantitative data, data mining, statistical and mathematical modeling, scenario/alternative analysis, machine learning, advanced analytic techniques<br>Required certifications: N/A<br>Desired skills/experience: Software development, developing and documenting custom algorithms in response to customer requirements, SQL, R, Python<br>Desired certifications: N/A<br>Description<br>•\tDemonstrated on-the-job experience manipulating data for analysis<br>•\tDemonstrated on-the-job experience constructing complex queries to analyze results using databases or data processing development environments<br>•\tWorking knowledge of appropriate analytic methods and methodological tools in one or more of the following areas: Applied mathematics (probability and statistics, formal modeling, computational social sciences), Computer programming (programming languages, math/statistic packages, computer science, machine learning, scientific computing), Visualization (GIS/geosptial analysis)<br>•\tAbility to leverage multiple data management tools to organize relevant information and make decisions<br>•\tAbility to develop comprehensive software applications, as needed<br>•\tAbility to translate complex, technical findings into an easily understood narrative in graphical, verbal or written form.<br>•\tAbility to identify gaps and offer technical solutions based on both technical and non-technical descriptions of customer workflows and requirements<br>•\tDetermine and employ the most appropriate research design for data collection and analysis<br>•\tAcquire, process, and refine large and complex data sets from various sources; utilizing computer programming where necessary<br>•\tAnalyze, evaluate, and assess quantitative data to contribute to or develop software tools, analytic models or reports<br>•\tConduct statistical, mathematical, geospatial modeling or data-mining analysis in partnership with other Data Scientists or Analysts <br>•\tAnticipate or project possible outcomes using scenario/alternative analysis, machine learning, and other advanced analytic techniques. -  Identify, use and/or develop a wide range of methodologies and analytic tools to address existing or potential problems and strategies. <br>•\tDemonstrated on the job experience with software development<br>•\tDemonstrated on the job experience developing and documenting custom algorithms in response to customer requirements<br>•\tDemonstrated on the job experience with SQL, R, Python",
            "title": "Data Architect"
        },
        {
            "daysVacant": 31,
            "id": "TTG 146",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Location: Herndon The candidate must have the ability to design, develop, deliver, and implement data solutions. Must be able to manage day-to-day tasks/activities in coordination with a team of engineers and developers to effectively meet the deliverables and schedule for the project. Candidate must have working experience with Oracle, Oracle RAC, TOAD, MYSQL, and SQL Server databases for Windows and Linux platforms. Demonstrated experience in documenting database installation guide, tuning, backup, and restore procedures.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Database Administrator"
        },
        {
            "daysVacant": 64,
            "id": "TTG 147",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Location: Herndon.  Looking for an Expert Domino developer with experience in Java, JavaScript, LotusScript, JQuery, CSS, HTML, with special emphasis on XPages.  Additionally, knowledge of AWS/Cloud administration, Lotus Domino Administration, and SharePoint development is desired, but not required.  Will work on a small team of developers fulfilling organizational specific tasks.  Core Hours: 9 a.m. to 3: p.m.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Developer (Systems Software)"
        },
        {
            "daysVacant": 159,
            "id": "TTG 148",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "Software Developer:<br>* Provides development engineering and programming support to mission-supporting applications. <br>* Designs and develops mission applications in a web environment. <br>* Develops, creates and modifies general computer applications software or specialized utility programs.<br>* Analyzes user needs and develops software solutions.<br>* Designs software or customizes software for client use with the aim of optimizing operational efficiency.<br>* May analyze and design databases within an application area, working individually or coordinating database development as part of a team.<br>* May manage websites including design, development, deployment and maintenance activities, as well as performing testing and quality assurance of websites and web applications.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Software Developer (Systems Software)"
        },
        {
            "daysVacant": 17,
            "id": "TTG 149",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Web based software development",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "This successful candidate will work at the Group level to develop dashboards and further enhancements to a Budgeting and Planning tool. Software development will use Angular, Java, Javascript and other front end scripting for dashboards. Ability to gather requirements for enhancement and changes and communicate to non technical high level government officials on work products. This role is high visibility and has the ability to go all the way to the directorate level government leadership. <br>5+ years Software Development <br>3+ years Java (j2ee) Development <br>Experience with web based development for Java applications, specifically user interface design<br>Experience and familiarity with modern web based development frameworks or component libraries<br>Java/j2ee development, Software engineering and problem solving<br>Need for experience with AngularJS, NodeJS<br>Desired: <br>Bachelors degree or equivalent experience <br>Experience working in a large enterprise environment<br>Experience with Adobe/Apache Flex<br>Experience with JSF, Subversion, Apache ANT, WebSphere, and JSP",
            "title": "Software Developer (Systems Software) - Mission Software Developer"
        },
        {
            "daysVacant": 24,
            "id": "TTG 150",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "Mission Software Developer – <br>Required Skills/Experience:<br>•\tStrong understanding of the Software Development Life Cycle and software architecture <br>•\tStrong understanding of data management, databases, data transmission, data modeling<br>•\tExperience in system design and analysis <br>•\tExperience with high volume data environments<br>•\tExperience transforming bulk data into common structured formats for ingestion into analytical tools, writing custom scripts  as needed<br>•\tExperience searching collateral information in targeting and analytic repositories to correlate data and communications metadata<br>•\tExperience working on large mission critical software projects<br>•\tExperience programming in AWS, AngularJS, ETL, Java Spring / Spring Boot, Javascript, and HTML5, or other related programming languages<br>•\tExperience with relational databases and SQL<br>•\tExperience with JIRA, GIT, Artifactory, or related tools <br>Desired Skills/Experience:<br>•\tExperience with Amazon Web Services cloud solutions, to include design, development, and deployment<br>•\tExperience working in an Agile development environment <br>•\tExperience working with enterprise products for high throughput data ingestion and transformation processing <br>•\tExperience with data modeling and related technical areas such as information extraction, time series forecasting, and machine learning algorithms and applications <br>•\tExperience with Extract, Load, and Transform (ETL) Tools<br>•\tExperience with automated functional and non – functional testing<br>•\tExperience with Selenium, JUnit or related tools <br>•\tExperience using scripts languages such as Python",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Mission Software Developer – <br>•\tStrong understanding of the Software Development Life Cycle and software architecture <br>•\tStrong understanding of data management, databases, data transmission, data modeling<br>•\tExperience in system design and analysis <br>•\tExperience with high volume data environments<br>•\tExperience transforming bulk data into common structured formats for ingestion into analytical tools, writing custom scripts  as needed<br>•\tExperience searching collateral information in targeting and analytic repositories to correlate data and communications metadata<br>•\tExperience working on large mission critical software projects<br>•\tExperience programming in AWS, AngularJS, ETL, Java Spring / Spring Boot, Javascript, and HTML5, or other related programming languages<br>•\tExperience with relational databases and SQL<br>•\tExperience with JIRA, GIT, Artifactory, or related tools <br>Desired Quals<br>•\tExperience with Amazon Web Services cloud solutions, to include design, development, and deployment<br>•\tExperience working in an Agile development environment <br>•\tExperience working with enterprise products for high throughput data ingestion and transformation processing <br>•\tExperience with data modeling and related technical areas such as information extraction, time series forecasting, and machine learning algorithms and applications <br>•\tExperience with Extract, Load, and Transform (ETL) Tools<br>•\tExperience with automated functional and non – functional testing<br>•\tExperience with Selenium, JUnit or related tools <br>•\tExperience using scripts languages such as Python<br>This dynamic candidate will be part of a team delivering new systems and solutions in C2S/AWS to our mission partner. Primarily a technical role additional responsibility for this position is working with software team and other engineering, operations, and software development resources across the division to meet overall mission technical needs and provide solutions across the group. Cloud technologies used daily.",
            "title": "Software Developer (Systems Software) - Mission Software Developer"
        },
        {
            "daysVacant": 161,
            "id": "TTG 151",
            "level": "Expert",
            "location": "McLean",
            "qualifications": "Hours: Core, Flexible<br>Required skills/experience: Extensive Extract, Transform and Load (ETL), data model analysis, analysis of user interfaces and dataflows, maintain hardware and software performance, develop specifications and performance requirements, solve customer issues, monitor equipment, manipulate data for analysis, develop on cloud environment, Pentaho, Streamsets, NiFi, Airflow, Java, C++, Visual Basic and scripting languages such as Perl, BASH, Python, Oracle and MySQL, writing complex SQL queries, ElasticSearch, Cassandra, MongoDB, Hadoop and/or Spark, hands-on experience working with COTS, GOTS and Open Source capabilities.<br>Required certifications: N/A",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Hours: Core, Flexible<br>Required skills/experience: Extensive Extract, Transform and Load (ETL), data model analysis, analysis of user interfaces and dataflows, maintain hardware and software performance, develop specifications and performance requirements, solve customer issues, monitor equipment, manipulate data for analysis, develop on cloud environment, Pentaho, Streamsets, NiFi, Airflow, Java, C++, Visual Basic and scripting languages such as Perl, BASH, Python, Oracle and MySQL, writing complex SQL queries, ElasticSearch, Cassandra, MongoDB, Hadoop and/or Spark, hands-on experience working with COTS, GOTS and Open Source capabilities.<br>Required certifications: N/A<br>Description<br>•\tDemonstrated experience in information systems development, focused on bridging engineering, technology, and end user requirements with data owner, legal and policy requirements of data feeds<br>•\tExtensive Extract, Transform and Load (ETL) experience, to include data model analysis, mapping various types of data, implementing mappings as ETL routines, and debugging existing ETL routines<br>•\tResearch, design, develop, and test operating systems level software, compilers and network distribution software for industrial, military, communications, aerospace, business, scientific, and general computing applications and dataflows<br>•\tAnalyze user interfaces and dataflows, maintain hardware and software performance tuning, analyze workload and computer usage, maintain interfaces with outside systems, analyze downtimes, analyze proposed system modifications, upgrade and new COTS<br>•\tCoordinate closely with programmers to ensure proper implementation of program and system specifications<br>•\tReview existing programs and assist in making refinements, reducing operating time and improve its performance<br>•\tConfer with system analysts, engineers, programmers and others to design system and to obtain information on project limitations and capabilities, performance requirements, and interfaces<br>•\tObtain and evaluate information on factors such as reporting formats required, costs, and security needs, to determine hardware configuration<br>•\tConsult with engineering staff to evaluate interface between hardware and software, develop specifications and performance requirements, and resolve customer problems<br>•\tMonitor functioning of equipment to ensure system operates in conformance with specifications<br>•\tStore, retrieve, and manipulate data for analysis of system capabilities and requirements<br>•\tDesign, develop, and maintain applications within the cloud environment for new or legacy applications<br>•\tMultiple years working with Pentaho, Streamsets, NiFi, Airflow, or similar application for platform deployment, patch deployment, and plugin creation<br>•\tProven development abilities in multiple object-oriented languages such as Java, C++, Visual Basic and scripting languages such as Perl, BASH, Python. Database design and programming on multiple platforms including Oracle and MySQL<br>•\tDemonstrated experience writing complex SQL queries, writing data, table and index management statements and understanding database structures, indices, normal forms to improve performance<br>•\tExperience with ElasticSearch, Cassandra, MongoDB. Big data platform development and administration including against Hadoop and/or Spark<br>•\tDemonstrated hands-on experience working with COTS, GOTS and Open Source capabilities for processing data to meet analytical requirements",
            "title": "Software Engineer"
        },
        {
            "daysVacant": 166,
            "id": "TTG 152",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "Hours: Standard core hours 9:00 – 3:00, anything before or after allowing for a full 8 hours/day<br>Required Experience/Skills:<br>•\tProvide operations support on the DevOps team<br>•\tSupport the integration of new systems, applications and networks<br>•\tPerform all system admin functions, DevOps related duties and integration into the development cycle<br>•\tBachelor’s degree in Computer Science, Engineering or a related technical discipline; can be a combination of education, technical training or work/military experience<br>•\tDemonstrated hands on experience and knowledge of Linux platform (RHEL, CentOS)<br>•\tDemonstrated hands on experience and knowledge of Windows platform (Windows 7/10, Windows Server 2012+)<br>•\tHigh-level knowledge of Cloud Computing, Cloud Foundry, Cloud Watch<br>•\tScripting experience with YAML, JSON and BASH to automate installations, deployments and configuration<br>•\tDemonstrated experience provisioning servers, networks, storage, using code versioning software and performing software builds<br>•\tAbility to execute code deployment / migration and system configuration across multiple environments to Linux / Windows servers<br>•\tExperience using automated deployment tools, packaged RPMs, Maven and Jenkins jobs<br>•\tAbility to provide full integration support throughout the total system lifecycle across multiple systems, applications and platforms. This will include relevant policies, standards, methods and frameworks<br>•\tExperience with automation and configuration management (e.g. Ansible, Puppet, Chef and other DevOps standards)<br>Desired Experience/Skills:<br>•\tExpert knowledge and experience with Linux/Unix<br>•\tStrong virtualization Experience<br>•\tExperience with TCP/IP and general networking issues<br>•\tExperience with data mining and monitoring tools (e.g. Splunk, Nagios)",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Systems Engineer - Operations Integration Level Expert <br>Required Experience/Skills: <br>•\tBachelors Degree in Computer Science, Engineering or a related technical discipline, or the equivalent combination of education, technical training, or work/military experience.<br>•\tUnderstanding of all phases of the software development lifecycle, the system engineering lifecycle, and the ability to comprehend end-user business needs and concerns while integrating the understanding with technical skills<br>•\tDemonstrated hands-on experience and knowledge of Linux platform (i.e. RHEL, CentOS) including administration, management, and troubleshooting<br>•\tHands on experience designing and writing scripts (I.e. powershell, bash, groovy) for the automation of installations, deployments, and configuration<br>•\tHigh-level knowledge of Cloud Computing, Cloud Foundry, Cloud Watch<br>•\tScripting experience with YAML, JSON (Ansible)<br>•\tAbility to work under pressure and time constraints<br>•\tDemonstrated ability to successfully multi-task simultaneous ongoing assignments and efforts<br>•\tDemonstrated experience performing the provisioning of development servers, networks, storage, use code versioning software, and performing software builds<br>•\tExecutes code deployment / migration and system configuration across multiple environment to Linux / Windows servers<br>•\tUses automated deployment tools, packaged RPM's, Maven, and Jenkins jobs<br>•\tProvides full integration support throughout the total system life cycle (including maintenance, administration, and management) across multiple systems/application/platforms, including a familiarity of relevant policies, standards, methods, and frameworks.<br>•\tTranslate business and technical requirements into test cases, test scenarios, and operations scripts and strong people skills for working with end-users<br>•\tAbility to plan and account for impacts of system development efforts across architectural system components, critical business processes, data, and applications<br>•\tExperience with automation / configuration management (Ansible, Puppet, Chef) and DevOps<br>•\tAbility and willingness to learn job related material and tasks<br>Desired Experience/Skills: <br>•\tExpert knowledge and experience with Linux/Unix<br>•\tStrong virtualization <br>•\tExperience with TCP/IP and general networking issues<br>•\tExperience providing superior customer service and support<br>•\tExperience with data mining tools (i.e., Splunk)<br>•\tExperience with monitoring tools (i.e., Nagios)",
            "title": "Systems Engineer"
        },
        {
            "daysVacant": 180,
            "id": "TTG 153",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Build Engineer",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Systems Engineer/Systems Integrator - BUILD Engineer<br>Senior Systems Integration Engineer. The primary responsibility for this position is working with management team and engineering and operational resources.<br>Working under minimal supervision the selected candidate will work with a technical group on projects from reviewing requirements to ensure system compatibility for optimal system performance; collaborate with business users to discuss requirements; perform current state system analysis; write functional and technical specifications of current state systems, provide weekly status reports regarding system engineering and integration initiatives. The successful candidate will have proven experience with establishing integrated project team structure and assignments and experience leading, directing and managing enterprise IT system development/engineering efforts, tasking, and schedules through work breakdown structure and program planning.<br>This role requires someone with proven experience implementing cross domain solutions that support requirements of varying complexity in addition to planning and managing the coordinated effort of a team of different stakeholders, information technology, and related technical professionals, to include personnel with different organizations with competing interest (e.g., customer, cross domain governing bodies, hosting facility, and technology provider).<br>• Bachelor's degree in Computer Science, System Engineering or related field and 13 years of professional experience which should include either management consulting experience or relevant industry knowledge<br>• Understanding of all phases of the software development lifecycle, the System Engineering Life Cycle, and the ability to comprehend user business needs and concerns and integrate that understanding with technical skills<br>*Translate business and technical requirements into test cases, test scenarios, and operational scripts<br>*Ability to plan and account for impacts of system development efforts across architectural system components, critical business processes, data, and application<br>*Strong background in Linux/Unix Administration<br>*Experience with automation / CM (Ansible, Puppet, Chef) and working knowledge of code and scripting (python, perl, ruby, etc<br>• Hands-on experience designing and writing scripts (i.e. power shell, bash, groovy) for the automation of installations, deployments and configuration<br>• Ability to Work under pressure and time constraints<br>• Demonstrated ability to successfully multi-task simultaneous ongoing assignments and efforts<br>• Demonstrated experience performing the setup and configuration of IDE and development servers, use code versioning software, and performing software builds<br>• Execute code deployment/migration and system configuration across multiple environments to Linux and Windows servers<br>• Use automated deployment tools, packaged RPMs, Maven and Jenkins Jobs<br>• Provide full integration support throughout the total system life cycle (including maintenance, administration, and management) across multiple systems/applications/platforms, including a familiarity of relevant policies, standards, methodologies and frameworks<br>• Ability and willingness to learn job related material and tasks<br>Desired Skills: <br>*Expert knowledge and experience with Linux/Unix<br>*Strong Virtualization skills (vmware, openstack, hyper v)<br>*Proven track record of building and deploying an automation framework from scratch using Ansible<br>• Knowledge of Big Data tools including Hadoop ecosystem, blur, etc.<br>• Experience with Enterprise monitoring tools (i.e Splunk and Nagios)<br>• Knowledge of enterprise monitoring and logging solutions<br>• Ability to identify gaps in system designs as it relates to enterprise monitoring and logging standards",
            "title": "Systems Engineer"
        },
        {
            "daysVacant": 369,
            "id": "TTG 154",
            "level": "Subject Matter Expert",
            "location": "Herndon",
            "qualifications": "The primary focus of this position is engineering, Cloud Engineering, and Data and Application Security. The secondary focus of this position is platform engineering, including 30% Windows and Citrix O&M. The Cloud Engineer is responsible for developing and maintaining high visibility cloud-based IT systems. The successful candidate provides support for development in and/or transition  to the cloud, implementation, troubleshooting and maintenance of IT systems. Manages system infrastructure and any processes related to these systems. Provides support to IT systems including : day-to-day operations, monitoring and problem resolution for all of the client problems. This position will serve as the Engineering SME and will be responsible for the development and delivery of the modular enterprise architecture,  engineering design, and implementation plan of the identity management to support the mission and vision. The modular enterprise engineering design must be flexible to support the infrastructure hosting workloads for Amazon Web Services (AWS). The position will be responsible for the development and delivery of Sponsor's cloud adoption and migration. This position will serve as the Platform Engineering SME to provide the technical guidance and direction to design the modular operating system baselines to support the modular data and application Tier hosting strategy. This position will serve as the Data and Application Security SME to provide technical guidance and direction to engineering a modular security design to protect the workloads hosting services for Amazon Web Services (AWS). This position will introduce and champion the SysOps and DevOps concepts for the Sponsor. The successful candidate will need to demonstrate outstanding hands-on experience and thorough understanding hands-on experience and thorough Platform engineering, Data and Application Security engineering and Cloud services. The candidate must demonstrate on-the-job competences and in-depth Linux experience working and integrating  Open Source frameworks/products, experience deploying various open source packages and/or application stacks into sponsor's production landscape, multi-core, multi-threaded and distributed system. The selected candidate will be expected to know how to both craft and drive good requirements and specifications documentation. The selected candidate will be expected to quickly self-learn new technologies and be passionate when it comes to making technical breakthroughs and solving complex problems. The selected candidate will need to have a diverse IT background, strong hands-on technical experience, organizational and interpersonal skills working as part of a team and at times in a highly autonomous manner, mentoring others as needed. Additional mandatory skills: 1) Demonstrated competencies with enterprise solutions architecture, technical  leadership and strategy, enterprise data and analytic engineering, enterprise software development and SysOps/DevOps. 2) Demonstrated engineering experience and outstanding in-depth knowledge with Cyber security, Cloud Computing, Data and Application Security technologies. 3) Demonstrated engineering experience and knowledge with Linus (RHEL, VentOS, Scientific Linux) and Microsoft Windows Server (2008 r2, 2012 R2) environments and be able to build, configure and maintain via Command Line Interface (CLI). 4) Demonstrated engineering experience and outstanding in-depth knowledge with the underlying storage for Linux (LVM), storage network technologies (e.g. SAN, NAS) and protocols (e.g. NFS, CIFS), database (e.g. Oracle, MySQL, SQK+L, Server, Postgres, Kafka, etc.) and/or clustered/pooled virtualizations concepts from leading platforms (e.g. XenServer, Hyperv, VMware, etc.) creating and configuring virtual and private clouds (VPCs). 5) demonstrated engineering experiences and outstanding in-depth knowledge of information security practices (cryptography, privilege separation, RBAC, Auditing, Patching, Security Benchmark compliance, OS hardening, etc.) 6) Demonstrated experience using Amazon Web Service technologies AWS Command Line, Amazon Machine Images, Creating elastic Compute Cloud (EC2) instances, Simple Storage Service (S3), Elastic Block Storage (EBS), Virtual Private Cloud or Cloud Watch. 7) Demonstrated Tier -3 SME troubleshooting, investigating, and performing root cause analysis on production incidents. Evaluating systems and making recommendations to increase availability and efficiency. 8) Demonstrated engineering experience and outstanding in-depth knowledge with server hardware from major vendors such as IBM or HP. 9) Demonstrated in-depth understanding of proactive monitoring concepts, including experience configuring and deploying Network and system's monitoring, SNMP, Relational Databases (e.g. Ganglia, Nagios, Splunk, Solarwinds, NosQL and caching layers such as Memcache). 10) Demonstrated in-depth troubleshooting and outstanding understanding of Internet/Web related protocols and technologies (e.g. Apache, Tomcat., Web Services, DNS, registrars, SSL, web hosting providers).",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Systems Engineer - Cloud Engineer"
        },
        {
            "daysVacant": 25,
            "id": "TTG 155",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "Secondary scrub required.  <br>Required Skills:<br>•\tAbility to estimate software/hardware acquisition, testing and delivery requirements to include tentative cost and schedule for each<br>•\tAbility to Analyze equipment performance records to determine whether adjustments need to be made<br>•\tMaintain logs related to network functions, as well as maintenance and repair records<br>•\tAbility to research new technology and implement it for recommend its implementation<br>•\tAbility to diagnose hardware and software problems and replace defective components<br>Desired Skills:<br>•\tSomeone that is a recognized expert or certified practitioner with a particular computer language, system or technology that can not only deliver capabilities, but can mentor and train others.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Secondary scrub required.  <br>Required Skills:<br>•\tAbility to estimate software/hardware acquisition, testing and delivery requirements to include tentative cost and schedule for each<br>•\tAbility to Analyze equipment performance records to determine whether adjustments need to be made<br>•\tMaintain logs related to network functions, as well as maintenance and repair records<br>•\tAbility to research new technology and implement it for recommend its implementation<br>•\tAbility to diagnose hardware and software problems and replace defective components<br>Desired Skills:<br>•\tSomeone that is a recognized expert or certified practitioner with a particular computer language, system or technology that can not only deliver capabilities, but can mentor and train others.<br>Work summary: Customer is seeking expertise to assist with investigative efforts to identify and analyze all or part of a component's existing or new peripheral, network, and telecommunications systems requirements, taking into consideration the special technology needs.  Candidate will establish functional and technical specifications and standards, solve hardware and software interface problems, define input/output parameters, and ensure integration of the entire systems or subsystems.  Work with engineers, systems analysts, programmers, technicians, scientists and top level managers in the design, testing and evaluation of systems.  Track/maintain Mission Departments technical support requirements for business areas, to include system acquisition, configuration, assessment and/or other related testing reports.  Work to coordinate maintenance missions, document acquisition activities, system upgrades and recap efforts.  Establish and maintain baseline functional and technical specifications/standards for each system deployed.  Test and evaluate hardware and software to determine efficiency, reliability, and compatibility with existing systems, and make purchase recommendations.  Manage and update master support schedule.",
            "title": "Systems Integrator"
        },
        {
            "daysVacant": 25,
            "id": "TTG 156",
            "level": "Expert",
            "qualifications": "Location: Herndon/Chantilly.  Secondary scrub required.  Work summary: Seeking expertise to assist with investigative efforts in the identifying and analyzing of all or part of a component's existing or new peripheral, network, and telecommunications systems requirements, taking into consideration the special technology needs.  Candidate will establish functional and technical specifications and standards, solve hardware and software interface problems, define input/output parameters, and ensure integration of the entire systems or subsystems. Work with engineers, systems analysts, programmers, technicians, scientists and top level managers in the design, testing and evaluation of systems. Track/maintain Mission Departments technical support requirements for business areas, to include system acquisition, configuration, assessment and/or other related testing reports. Work to coordinate maintenance missions, document acquisition activities, system upgrades and recap efforts. Establish and maintain baseline functional and technical specifications/standards for each system deployed. Test and evaluate hardware and software to determine efficiency, reliability, and compatibility with existing systems, and make purchase recommendations. Manage and update master support schedule.<br>Required Skills:<br>•\tAbility to estimate software/hardware acquisition, testing and delivery requirements to include tentative cost and schedule for each<br>•\tAbility to Analyze equipment performance records to determine whether adjustments need to be made<br>•\tMaintain logs related to network functions, as well as maintenance and repair records<br>•\tAbility to research new technology and implement it for recommend its implementation<br>•\tAbility to diagnose hardware and software problems and replace defective components<br>Desired Skills:<br>•\tSomeone that is a recognized expert or certified practitioner with a particular computer language, system or technology that can not only deliver capabilities, but can mentor and train others.<br>•\tGenerally 11 years of experience specific to the skills and relevant training or certifications.",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Systems Integrator"
        },
        {
            "daysVacant": 4,
            "id": "TTG 157",
            "level": "Expert",
            "location": "Herndon",
            "qualifications": "[3rd Party Administrator] Candidate will maintain 3rd party tools for the customer's current and new application hosting environments.  Candidate will be responsible for maintaining documentation, patching schedule, version updates, alerts for storage capacity, alerts for server capacity, alerts for database capacity, and alerts for network capacity and take the appropriate action to resolve.  Demonstrated experience with O&M of 3rd party tools for different layers of the IT infrastructure: Network, Storage, Windows & Linux Platforms and Databases (Oracle, MySQL, SQL Servers Postgres) and Applications.  Monitoring tools (e.g. Splunk, Nagios, RedSeal), Linux (e.g. Centos, RedHat, Solaris), Windows Servers (2008, 2012), Apache Tomcat, Development languages (e.g. Python, Shell, Java, JavaScript, PERL, Logstash, Kibana, Rstudio), Scripting, and Cloud Services (AWS, OpenStack, Azure)",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Systems Operations Specialist"
        },
        {
            "daysVacant": 120,
            "id": "TTG 158",
            "level": "Senior",
            "location": "Herndon",
            "qualifications": "SharePoint, Visual Studio, .NET, Node.js, Web Dev, Angular. Experience on both MEAN and SharePoint platforms. This includes development of SharePoint out of the box and the development and O&M of the full MEAN stack which includes DBA functions for MongoDB, WebServer configuration for routing, authentication, authorization, IDAM, STS and SAL, Angular front-end design and Angular Library Component development. Ability to:<br>Write and troubleshoot custom aggregation queriesi n MongoDb<br>Install and configure MongoDB database environment<br>Develop and maintain highly customized routes in Express.js<br>integrate Express.js with external web services<br>Design and develop applications using Angular<br>Contribute to code reviews with Git Hub<br>Configure Node.js server environment and develop custom scripts",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "title": "Web Developer"
        },
        {
            "daysVacant": 121,
            "id": "TTG 159",
            "level": "Full Performance",
            "location": "Herndon",
            "qualifications": "Hours: Core, Flexible<br>Required Skills/Experience: Demonstrated on-the-job experience with web user interface; multimedia application integration into websites; designing and developing custom websites; designing and developing custom websites and interactive applications. Key experience with JOOMLA, HTML, JavaScript, CSS, SharePoint and Dev Ops. <br>Desired Skills/Experience: Demonstrated on-the-job experience with Adobe Master Collection, AJAX, PHP, Ruby, XSLT, SQL Server or JSP.<br>Required Certifications: N/A<br>Desired Certifications: N/A",
            "reportDate": "May 01 2020",
            "requirements": [
                "US citizenship",
                "Active TS/SCI with Polygraph"
            ],
            "responsibilities": "Hours: Core, Flexible<br>Required Skills/Experience: Demonstrated on-the-job experience with web user interface; multimedia application integration into websites; designing and developing custom websites; designing and developing custom websites and interactive applications. Key experience with JOOMLA, HTML, JavaScript, CSS, SharePoint and Dev Ops. <br>Desired Skills/Experience: Demonstrated on-the-job experience with Adobe Master Collection, AJAX, PHP, Ruby, XSLT, SQL Server or JSP.<br>Required Certifications: N/A<br>Desired Certifications: N/A",
            "title": "Web Developer"
        }
    ],
    "timestamp": "Friday 05/01/20 15:46:03"
}